public_html/Embedded-System/Qcom-ipq40xx/ipq40xx-device-tree-overview.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Qcom IPQ40xx Device Tree Overview</title>
<!-- 2016-12-14 Wed 22:19 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Shi Shougang" />
<link href="../../assets/bootstrap.min.css" rel="stylesheet" media="screen">
<link href="../../assets/bootstrap-responsive.min.css" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">Qcom IPQ40xx Device Tree Overview</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">4 cores of CPU</a>
<ul>
<li><a href="#sec-1-1">Application Processor Sub-system (APSS) Application Clock Controller (ACC)</a></li>
</ul>
</li>
<li><a href="#sec-2">clocks: sleep clk and xo</a></li>
<li><a href="#sec-3">all bus definition</a></li>
<li><a href="#sec-4">Interrupt Controller</a></li>
<li><a href="#sec-5">QCA Global Counter</a></li>
<li><a href="#sec-6">Qualcomm Global Clock &amp; Reset Controller Binding</a></li>
<li><a href="#sec-7">ARM architected timer</a></li>
<li><a href="#sec-8">MSM Restart Driver</a></li>
<li><a href="#sec-9">Qualcomm Krait Processor Sub-system (KPSS) Watchdog</a></li>
<li><a href="#sec-10">Qualcomm Atheros IPQ40xx TLMM block</a></li>
<li><a href="#sec-11">MSM Serial UARTDM</a></li>
<li><a href="#sec-12">SPS (Smart Peripheral Switch)</a></li>
<li><a href="#sec-13">Qualcomm Universal Peripheral (QUP) Serial Peripheral Interface (SPI)</a></li>
<li><a href="#sec-14">Qualcomm Parallel Interface controller (QPIC) for NAND devices</a></li>
<li><a href="#sec-15">QCOM TCSR (Top Control and Status Register)</a></li>
<li><a href="#sec-16">Qualcomm Atheros SuperSpeed DWC3 USB SoC controller</a></li>
<li><a href="#sec-17">Qualcomm MSM pseudo random number generator</a></li>
<li><a href="#sec-18">Qualcomm I2C controller</a></li>
<li><a href="#sec-19">QCEDEV and QCRYPTO</a></li>
<li><a href="#sec-20">QCA WLAN Driver</a></li>
<li><a href="#sec-21">QCA Ethernet Subsystem</a></li>
<li><a href="#sec-22">MSM PCIe</a></li>
<li><a href="#sec-23">QCA LED</a></li>
<li><a href="#sec-24">ARM Performance Monitor Units</a></li>
<li><a href="#sec-25">Qualcomm SDHCI controller (sdhci-msm)</a></li>
<li><a href="#sec-26">QCA SCM<sub>RESTART</sub><sub>REASON</sub></a></li>
<li><a href="#sec-27">cpufreq driver</a></li>
<li><a href="#sec-28">qcom-ipq40xx-ap.dk04.1</a>
<ul>
<li><a href="#sec-28-1">uart1(serial)</a></li>
<li><a href="#sec-28-2">qcom-ipq40xx-ap.dk04.1</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">4 cores of CPU</h2>
<div class="outline-text-2" id="text-1">
<p>
The device tree allows to describe the layout of CPUs in a system through
the "cpus" node, which in turn contains a number of subnodes (ie "cpu")
defining properties for every cpu.
</p>

<div class="org-src-container">

<pre class="src src-sh">cpus {
        <span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">address-cells = &lt;1&gt;;</span>
        <span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">size-cells = &lt;0&gt;;</span>
        cpu@0 {
                <span style="color: #eedd82;">device_type</span> = <span style="color: #ffa07a;">"cpu"</span>;
                <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"arm,cortex-a7"</span>;
                enable-method = <span style="color: #ffa07a;">"qcom,arm-cortex-acc"</span>;
                <span style="color: #eedd82;">reg</span> = &lt;0&gt;;
                <span style="color: #eedd82;">clocks</span> = &lt;&amp;gcc GCC_APPS_CLK_SRC&gt;;
                clock-frequency = &lt;0&gt;;
        };

        cpu@1 {
                <span style="color: #eedd82;">device_type</span> = <span style="color: #ffa07a;">"cpu"</span>;
                <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"arm,cortex-a7"</span>;
                enable-method = <span style="color: #ffa07a;">"qcom,arm-cortex-acc"</span>;
                <span style="color: #eedd82;">reg</span> = &lt;1&gt;;
                <span style="color: #eedd82;">clocks</span> = &lt;&amp;gcc GCC_APPS_CLK_SRC&gt;;
                clock-frequency = &lt;0&gt;;
        };

        cpu@2 {
                <span style="color: #eedd82;">device_type</span> = <span style="color: #ffa07a;">"cpu"</span>;
                <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"arm,cortex-a7"</span>;
                enable-method = <span style="color: #ffa07a;">"qcom,arm-cortex-acc"</span>;
                <span style="color: #eedd82;">reg</span> = &lt;2&gt;;
                <span style="color: #eedd82;">clocks</span> = &lt;&amp;gcc GCC_APPS_CLK_SRC&gt;;
                clock-frequency = &lt;0&gt;;
        };

        cpu@3 {
                <span style="color: #eedd82;">device_type</span> = <span style="color: #ffa07a;">"cpu"</span>;
                <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"arm,cortex-a7"</span>;
                enable-method = <span style="color: #ffa07a;">"qcom,arm-cortex-acc"</span>;
                <span style="color: #eedd82;">reg</span> = &lt;3&gt;;
                <span style="color: #eedd82;">clocks</span> = &lt;&amp;gcc GCC_APPS_CLK_SRC&gt;;
                clock-frequency = &lt;0&gt;;
        };
};
</pre>
</div>

<ul class="org-ul">
<li><code>arm,cortex-a7</code>: <code>Documentation/devicetree/bindings/arm/cpus.txt</code>
</li>
<li><code>qcom,arm-cortex-acc</code>:
<code>Documentation/devicetree/bindings/arm/msm/acc.txt</code>
</li>
</ul>
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Application Processor Sub-system (APSS) Application Clock Controller (ACC)</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The ACC provides clock, power domain, and reset control to a CPU.
There is one ACC register region per CPU within the APSS remapped
region as well as an alias register region that remaps accesses to the
ACC associated with the CPU accessing the region.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">clocks: sleep clk and xo</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-sh">clocks {
        gcc_sleep_clk_src: gcc_sleep_clk_src {
                <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"fixed-clock"</span>;
                clock-frequency = &lt;32000&gt;;
                <span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">clock-cells = &lt;0&gt;;</span>
        };
        xo: xo {
                <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"fixed-clock"</span>;
                clock-frequency = &lt;48000000&gt;;
                <span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">clock-cells = &lt;0&gt;;</span>
        };
};
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">all bus definition</h2>
<div class="outline-text-2" id="text-3">
<p>
<code>arch/arm/boot/dts/qcom-ipq40xx-bus.dtsi</code>
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Interrupt Controller</h2>
<div class="outline-text-2" id="text-4">
<p>
ARM SMP cores are often associated with a GIC, providing per processor
interrupts (PPI), shared processor interrupts (SPI) and software
generated interrupts (SGI).
</p>

<p>
Primary GIC is attached directly to the CPU and typically has PPIs and SGIs.
Secondary GICs are cascaded into the upward interrupt controller and do not
have PPIs or SGIs.
</p>

<div class="org-src-container">

<pre class="src src-sh">intc: interrupt-controller@b000000 {
        <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"qcom,msm-qgic2"</span>;
        interrupt-controller;
        <span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">interrupt-cells = &lt;3&gt;;</span>
        <span style="color: #eedd82;">reg</span> = &lt;0x0b000000 0x1000&gt;,
        &lt;0x0b002000 0x1000&gt;;
};
</pre>
</div>

<ul class="org-ul">
<li><code>qcom,msm-qgic2</code>: <code>Documentation/devicetree/bindings/arm/gic.txt</code>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">QCA Global Counter</h2>
<div class="outline-text-2" id="text-5">
<p>
<code>Documentation/devicetree/bindings/clock/qca,gcnt.txt</code>
</p>
<div class="org-src-container">

<pre class="src src-sh">counter {
        <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"qcom,qca-gcnt"</span>;
        <span style="color: #eedd82;">reg</span> = &lt;0x004a1000 0x4&gt;;
};
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Qualcomm Global Clock &amp; Reset Controller Binding</h2>
<div class="outline-text-2" id="text-6">
<p>
<code>Documentation/devicetree/bindings/clock/qcom,gcc.txt</code>
</p>
<div class="org-src-container">

<pre class="src src-sh">gcc: clock-controller@1800000 {
        <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"qcom,gcc-ipq40xx"</span>;
        <span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">clock-cells = &lt;1&gt;;</span>
        <span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">reset-cells = &lt;1&gt;;</span>
        <span style="color: #eedd82;">reg</span> = &lt;0x1800000 0x60000&gt;;
};
adcc: clock-controller@7700038 {
        <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"qcom,adcc-ipq40xx"</span>;
        <span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">clock-cells = &lt;1&gt;;</span>
        <span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">reset-cells = &lt;1&gt;;</span>
        <span style="color: #eedd82;">reg</span> = &lt;0x7700038 0x1DC&gt;;
        <span style="color: #eedd82;">status</span> = <span style="color: #ffa07a;">"disabled"</span>;
};
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">ARM architected timer</h2>
<div class="outline-text-2" id="text-7">
<p>
<code>Documentation/devicetree/bindings/arm/arch_timer.txt</code>
</p>
<div class="org-src-container">

<pre class="src src-sh">timer {
        <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"arm,armv7-timer"</span>;
        <span style="color: #eedd82;">interrupts</span> = &lt;1 2 0xf08&gt;,
                     &lt;1 3 0xf08&gt;,
                     &lt;1 4 0xf08&gt;,
                     &lt;1 1 0xf08&gt;;
        clock-frequency = &lt;48000000&gt;;
};
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">MSM Restart Driver</h2>
<div class="outline-text-2" id="text-8">
<p>
A power supply hold (ps-hold) bit is set to power the msm chipsets.
Clearing that bit allows us to restart/poweroff. The difference
between poweroff and restart is determined by unique power manager IC
settings.
</p>

<p>
<code>Documentation/devicetree/bindings/power_supply/msm-poweroff.txt</code>
</p>
<div class="org-src-container">

<pre class="src src-sh">restart@4ab000 {
        <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"qcom,pshold"</span>;
        <span style="color: #eedd82;">reg</span> = &lt;0x4ab000 0x4&gt;;
};
</pre>
</div>
</div>
</div>
