src/Embedded-System/Qcom-ipq40xx/ipq40xx-device-tree-overview.org
* Qualcomm Krait Processor Sub-system (KPSS) Watchdog
=Documentation/devicetree/bindings/watchdog/qcom-wdt.txt=
#+begin_src sh
		watchdog@b017000 {
			compatible = "qcom,kpss-wdt-ipq40xx";
			reg = <0xb017000 0x40>;
			interrupt-names = "bark_irq";
			interrupts = <0 3 0>;
			clocks = <&gcc_sleep_clk_src>;
			timeout-sec = <10>;
			wdt_res = <0x4>;
			wdt_en = <0x8>;
			wdt_bark_time = <0x10>;
			wdt_bite_time = <0x14>;
			status = "ok";
		};
#+end_src
* Qualcomm Atheros IPQ40xx TLMM block
=Documentation/devicetree/bindings/pinctrl/qcom,ipq40xx-pinctrl.txt=

Please refer to ../gpio/gpio.txt and
../interrupt-controller/interrupts.txt for a general description of
GPIO and interrupt bindings.

Please refer to pinctrl-bindings.txt in this directory for details of the
common pinctrl bindings used by client devices, including the meaning of the
phrase "pin configuration node".

The pin configuration nodes act as a container for an abitrary number of
subnodes. Each of these subnodes represents some desired configuration for a
pin, a group, or a list of pins or groups. This configuration can include the
mux function to select on those pin(s)/group(s), and various pin configuration
parameters, such as pull-up, drive strength, etc.

#+begin_src sh
		tlmm: pinctrl@0x01000000 {
			compatible = "qcom,ipq40xx-pinctrl";
			reg = <0x01000000 0x300000>;
			gpio-controller;
			#gpio-cells = <2>;
			interrupt-controller;
			#interrupt-cells = <2>;
			interrupts = <0 208 0>;
		};
#+end_src
* MSM Serial UARTDM
The MSM serial UARTDM hardware is designed for high-speed use cases
where the transmit and/or receive channels can be offloaded to a
dma-engine. From a software perspective it's mostly compatible with
the MSM serial UART except that it supports reading and writing
multiple characters at a time.

=Documentation/devicetree/bindings/serial/qcom,msm-uartdm.txt=

#+begin_src sh
		serial@78af000 {
			compatible = "qcom,msm-uartdm-v1.4", "qcom,msm-uartdm";
			reg = <0x78af000 0x200>;
			interrupts = <0 107 0>;
			status = "disabled";
			clocks = <&gcc GCC_BLSP1_UART1_APPS_CLK>,
				<&gcc GCC_BLSP1_AHB_CLK>;
			clock-names = "core", "iface";
		};

		serial@78b0000 {
			compatible = "qcom,msm-uartdm-v1.4", "qcom,msm-uartdm";
			reg = <0x78b0000 0x200>;
			interrupts = <0 108 0>;
			status = "disabled";
			clocks = <&gcc GCC_BLSP1_UART2_APPS_CLK>,
				<&gcc GCC_BLSP1_AHB_CLK>;
			clock-names = "core", "iface";
		};
#+end_src
* SPS (Smart Peripheral Switch) 
SPS (Smart Peripheral Switch) may be used as a DMA engine to move data
in either the Peripheral-to-Peripheral (a.k.a. BAM-to-BAM) mode or the
Peripheral-to-Memory (a.k.a. BAM-System) mode. SPS includes BAM (Bus
Access Module) hardware block, BAM DMA peripheral, and pipe memory.

=Documentation/devicetree/bindings/dma/sps/sps.txt=

#+begin_src sh
		qcom,sps {
			compatible = "qcom,msm_sps_4k";
			qcom,device-type = <3>;
			qcom,pipe-attr-ee;
		};
#+end_src
* Qualcomm Universal Peripheral (QUP) Serial Peripheral Interface (SPI)
The QUP core is an AHB slave that provides a common data path (an output FIFO
and an input FIFO) for serial peripheral interface (SPI) mini-core.

=Documentation/devicetree/bindings/spi/qcom,spi-qup.txt=
#+begin_src sh
		spi_0: spi@78b5000 { /* BLSP1 QUP1 */
			compatible = "qcom,spi-qup-v2";
			#address-cells = <1>;
			#size-cells = <0>;
			reg-names = "spi_physical", "spi_bam_physical";
			reg = <0x78b5000 0x600>,
				<0x7884000 0x23000>;
			interrupt-names = "spi_irq", "spi_bam_irq";
			interrupts = <0 95 0>, <0 238 0>;
			spi-max-frequency = <24000000>;
			clocks = <&gcc GCC_BLSP1_QUP1_SPI_APPS_CLK>,
				<&gcc GCC_BLSP1_AHB_CLK>;
			clock-names = "core_clk", "iface_clk";
			qcom,infinite-mode = <0>;
			qcom,use-bam;
			qcom,bam-consumer-pipe-index = <4>;
			qcom,bam-producer-pipe-index = <5>;
			qcom,master-id = <0>;
			status = "disabled";
		};
#+end_src

* Qualcomm Parallel Interface controller (QPIC) for NAND devices
=Documentation/devicetree/bindings/mtd/msm_qpic_nand.txt=

#+begin_src sh
		qcom,nand@7980000 {
			compatible = "qcom,msm-nand";
			reg = <0x07980000 0x40000>,
				<0x07984000 0x1A000>;
			reg-names = "nand_phys",
					"bam_phys";
			interrupts = <0 101 0>;
			interrupt-names = "bam_irq";

			qcom,msm-bus,name = "qpic_nand";
			qcom,msm-bus,num-cases = <2>;
			qcom,msm-bus,num-paths = <1>;

			qcom,msm-bus,vectors-KBps =
				<91 512 0 0>,
				/* Voting for max b/w on PNOC bus for now */
				<91 512 400000 800000>;
			clock-names = "iface_clk", "core_clk";
			clocks = <&gcc GCC_QPIC_AHB_CLK>,
				<&gcc GCC_QPIC_CLK>;
			status = "disabled";
		};
#+end_src

* QCOM TCSR (Top Control and Status Register)
The TCSR provides miscellaneous control functions and status registers
for Qualcomm processors.

=Documentation/devicetree/bindings/soc/qcom/qcom,tcsr.txt=

#+begin_src sh
		tcsr: tcsr@194b000 {
			compatible = "qcom,tcsr";
			reg = <0x194b000 0x100>;
			qcom,usb-hsphy-mode-select = <TCSR_USB_HSPHY_HOST_MODE>;
			status = "disabled";
		};

		ess_tcsr: ess_tcsr@1953000 {
			compatible = "qcom,tcsr";
			reg = <0x1953000 0x1000>;
			qcom,ess-interface-select = <TCSR_ESS_PSGMII>;
		};
#+end_src
