public_html/Embedded-System/Qcom-ipq40xx/ipq40xx-device-tree-overview.html
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">Qualcomm Krait Processor Sub-system (KPSS) Watchdog</h2>
<div class="outline-text-2" id="text-9">
<p>
<code>Documentation/devicetree/bindings/watchdog/qcom-wdt.txt</code>
</p>
<div class="org-src-container">

<pre class="src src-sh">watchdog@b017000 {
        <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"qcom,kpss-wdt-ipq40xx"</span>;
        <span style="color: #eedd82;">reg</span> = &lt;0xb017000 0x40&gt;;
        interrupt-names = <span style="color: #ffa07a;">"bark_irq"</span>;
        <span style="color: #eedd82;">interrupts</span> = &lt;0 3 0&gt;;
        <span style="color: #eedd82;">clocks</span> = &lt;&amp;gcc_sleep_clk_src&gt;;
        timeout-sec = &lt;10&gt;;
        <span style="color: #eedd82;">wdt_res</span> = &lt;0x4&gt;;
        <span style="color: #eedd82;">wdt_en</span> = &lt;0x8&gt;;
        <span style="color: #eedd82;">wdt_bark_time</span> = &lt;0x10&gt;;
        <span style="color: #eedd82;">wdt_bite_time</span> = &lt;0x14&gt;;
        <span style="color: #eedd82;">status</span> = <span style="color: #ffa07a;">"ok"</span>;
};
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10">Qualcomm Atheros IPQ40xx TLMM block</h2>
<div class="outline-text-2" id="text-10">
<p>
<code>Documentation/devicetree/bindings/pinctrl/qcom,ipq40xx-pinctrl.txt</code>
</p>

<p>
Please refer to ../gpio/gpio.txt and
../interrupt-controller/interrupts.txt for a general description of
GPIO and interrupt bindings.
</p>

<p>
Please refer to pinctrl-bindings.txt in this directory for details of the
common pinctrl bindings used by client devices, including the meaning of the
phrase "pin configuration node".
</p>

<p>
The pin configuration nodes act as a container for an abitrary number of
subnodes. Each of these subnodes represents some desired configuration for a
pin, a group, or a list of pins or groups. This configuration can include the
mux function to select on those pin(s)/group(s), and various pin configuration
parameters, such as pull-up, drive strength, etc.
</p>

<div class="org-src-container">

<pre class="src src-sh">tlmm: pinctrl@0x01000000 {
        <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"qcom,ipq40xx-pinctrl"</span>;
        <span style="color: #eedd82;">reg</span> = &lt;0x01000000 0x300000&gt;;
        gpio-controller;
        <span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">gpio-cells = &lt;2&gt;;</span>
        interrupt-controller;
        <span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">interrupt-cells = &lt;2&gt;;</span>
        <span style="color: #eedd82;">interrupts</span> = &lt;0 208 0&gt;;
};
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11">MSM Serial UARTDM</h2>
<div class="outline-text-2" id="text-11">
<p>
The MSM serial UARTDM hardware is designed for high-speed use cases
where the transmit and/or receive channels can be offloaded to a
dma-engine. From a software perspective it's mostly compatible with
the MSM serial UART except that it supports reading and writing
multiple characters at a time.
</p>

<p>
<code>Documentation/devicetree/bindings/serial/qcom,msm-uartdm.txt</code>
</p>

<div class="org-src-container">

<pre class="src src-sh">serial@78af000 {
        <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"qcom,msm-uartdm-v1.4"</span>, <span style="color: #ffa07a;">"qcom,msm-uartdm"</span>;
        <span style="color: #eedd82;">reg</span> = &lt;0x78af000 0x200&gt;;
        <span style="color: #eedd82;">interrupts</span> = &lt;0 107 0&gt;;
        <span style="color: #eedd82;">status</span> = <span style="color: #ffa07a;">"disabled"</span>;
        <span style="color: #eedd82;">clocks</span> = &lt;&amp;gcc GCC_BLSP1_UART1_APPS_CLK&gt;,
                &lt;&amp;gcc GCC_BLSP1_AHB_CLK&gt;;
        clock-names = <span style="color: #ffa07a;">"core"</span>, <span style="color: #ffa07a;">"iface"</span>;
};

serial@78b0000 {
        <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"qcom,msm-uartdm-v1.4"</span>, <span style="color: #ffa07a;">"qcom,msm-uartdm"</span>;
        <span style="color: #eedd82;">reg</span> = &lt;0x78b0000 0x200&gt;;
        <span style="color: #eedd82;">interrupts</span> = &lt;0 108 0&gt;;
        <span style="color: #eedd82;">status</span> = <span style="color: #ffa07a;">"disabled"</span>;
        <span style="color: #eedd82;">clocks</span> = &lt;&amp;gcc GCC_BLSP1_UART2_APPS_CLK&gt;,
                &lt;&amp;gcc GCC_BLSP1_AHB_CLK&gt;;
        clock-names = <span style="color: #ffa07a;">"core"</span>, <span style="color: #ffa07a;">"iface"</span>;
};
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12">SPS (Smart Peripheral Switch)</h2>
<div class="outline-text-2" id="text-12">
<p>
SPS (Smart Peripheral Switch) may be used as a DMA engine to move data
in either the Peripheral-to-Peripheral (a.k.a. BAM-to-BAM) mode or the
Peripheral-to-Memory (a.k.a. BAM-System) mode. SPS includes BAM (Bus
Access Module) hardware block, BAM DMA peripheral, and pipe memory.
</p>

<p>
<code>Documentation/devicetree/bindings/dma/sps/sps.txt</code>
</p>

<div class="org-src-container">

<pre class="src src-sh">qcom,sps {
        <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"qcom,msm_sps_4k"</span>;
        qcom,device-type = &lt;3&gt;;
        qcom,pipe-attr-ee;
};
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13">Qualcomm Universal Peripheral (QUP) Serial Peripheral Interface (SPI)</h2>
<div class="outline-text-2" id="text-13">
<p>
The QUP core is an AHB slave that provides a common data path (an output FIFO
and an input FIFO) for serial peripheral interface (SPI) mini-core.
</p>

<p>
<code>Documentation/devicetree/bindings/spi/qcom,spi-qup.txt</code>
</p>
<div class="org-src-container">

<pre class="src src-sh">spi_0: spi@78b5000 { /* BLSP1 QUP1 */
        <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"qcom,spi-qup-v2"</span>;
        <span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">address-cells = &lt;1&gt;;</span>
        <span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">size-cells = &lt;0&gt;;</span>
        reg-names = <span style="color: #ffa07a;">"spi_physical"</span>, <span style="color: #ffa07a;">"spi_bam_physical"</span>;
        <span style="color: #eedd82;">reg</span> = &lt;0x78b5000 0x600&gt;,
                &lt;0x7884000 0x23000&gt;;
        interrupt-names = <span style="color: #ffa07a;">"spi_irq"</span>, <span style="color: #ffa07a;">"spi_bam_irq"</span>;
        <span style="color: #eedd82;">interrupts</span> = &lt;0 95 0&gt;, &lt;0 238 0&gt;;
        spi-max-frequency = &lt;24000000&gt;;
        <span style="color: #eedd82;">clocks</span> = &lt;&amp;gcc GCC_BLSP1_QUP1_SPI_APPS_CLK&gt;,
                &lt;&amp;gcc GCC_BLSP1_AHB_CLK&gt;;
        clock-names = <span style="color: #ffa07a;">"core_clk"</span>, <span style="color: #ffa07a;">"iface_clk"</span>;
        qcom,infinite-mode = &lt;0&gt;;
        qcom,use-bam;
        qcom,bam-consumer-pipe-index = &lt;4&gt;;
        qcom,bam-producer-pipe-index = &lt;5&gt;;
        qcom,master-id = &lt;0&gt;;
        <span style="color: #eedd82;">status</span> = <span style="color: #ffa07a;">"disabled"</span>;
};
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14">Qualcomm Parallel Interface controller (QPIC) for NAND devices</h2>
<div class="outline-text-2" id="text-14">
<p>
<code>Documentation/devicetree/bindings/mtd/msm_qpic_nand.txt</code>
</p>

<div class="org-src-container">

<pre class="src src-sh">qcom,nand@7980000 {
        <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"qcom,msm-nand"</span>;
        <span style="color: #eedd82;">reg</span> = &lt;0x07980000 0x40000&gt;,
                &lt;0x07984000 0x1A000&gt;;
        reg-names = <span style="color: #ffa07a;">"nand_phys"</span>,
                        <span style="color: #ffa07a;">"bam_phys"</span>;
        <span style="color: #eedd82;">interrupts</span> = &lt;0 101 0&gt;;
        interrupt-names = <span style="color: #ffa07a;">"bam_irq"</span>;

        qcom,msm-bus,<span style="color: #eedd82;">name</span> = <span style="color: #ffa07a;">"qpic_nand"</span>;
        qcom,msm-bus,num-cases = &lt;2&gt;;
        qcom,msm-bus,num-paths = &lt;1&gt;;

        qcom,msm-bus,vectors-KBps =
                &lt;91 512 0 0&gt;,
                /* Voting for max b/w on PNOC bus for now */
                &lt;91 512 400000 800000&gt;;
        clock-names = <span style="color: #ffa07a;">"iface_clk"</span>, <span style="color: #ffa07a;">"core_clk"</span>;
        <span style="color: #eedd82;">clocks</span> = &lt;&amp;gcc GCC_QPIC_AHB_CLK&gt;,
                &lt;&amp;gcc GCC_QPIC_CLK&gt;;
        <span style="color: #eedd82;">status</span> = <span style="color: #ffa07a;">"disabled"</span>;
};
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15">QCOM TCSR (Top Control and Status Register)</h2>
<div class="outline-text-2" id="text-15">
<p>
The TCSR provides miscellaneous control functions and status registers
for Qualcomm processors.
</p>

<p>
<code>Documentation/devicetree/bindings/soc/qcom/qcom,tcsr.txt</code>
</p>

<div class="org-src-container">

<pre class="src src-sh">tcsr: tcsr@194b000 {
        <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"qcom,tcsr"</span>;
        <span style="color: #eedd82;">reg</span> = &lt;0x194b000 0x100&gt;;
        qcom,usb-hsphy-mode-select = &lt;TCSR_USB_HSPHY_HOST_MODE&gt;;
        <span style="color: #eedd82;">status</span> = <span style="color: #ffa07a;">"disabled"</span>;
};

ess_tcsr: ess_tcsr@1953000 {
        <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"qcom,tcsr"</span>;
        <span style="color: #eedd82;">reg</span> = &lt;0x1953000 0x1000&gt;;
        qcom,ess-interface-select = &lt;TCSR_ESS_PSGMII&gt;;
};
</pre>
</div>
</div>
</div>
