src/Embedded-System/Qcom-ipq40xx/ipq40xx-device-tree-overview.org
* Qualcomm Atheros SuperSpeed DWC3 USB SoC controller
=Documentation/devicetree/bindings/usb/qca,dwc3.txt=
+ QCA BALDUR Highspeed USB PHY
+ QCA UNI Superspeed USB PHY
+ QCA DUMMY Superspeed USB PHY
+ QCA DWC3 controller wrapper

#+begin_src sh

		usb3_ss_phy: ssphy@0 {
			compatible = "qca,uni-ssphy";
			reg = <0x9a000 0x800>;
			reg-names = "phy_base";
			resets = <&gcc USB3_UNIPHY_PHY_ARES>;
			reset-names = "por_rst";
			qca,host = <1>;
			qca,emulation = <0>;
			status = "disabled";
		};

		dummy_ss_phy: ssphy@1 {
			compatible = "qca,dummy-ssphy";
			status = "disabled";
		};

		usb3_hs_phy: hsphy@a6000 {
			compatible = "qca,baldur-usb3-hsphy";
			reg = <0xa6000 0x40>;
			reg-names = "phy_base";
			resets = <&gcc USB3_HSPHY_POR_ARES>, <&gcc USB3_HSPHY_S_ARES>;
			reset-names = "por_rst", "srif_rst";
			qca,host = <1>;
			qca,emulation = <0>;
			status = "disabled";
		};

		usb2_hs_phy: hsphy@a8000 {
			compatible = "qca,baldur-usb2-hsphy";
			reg = <0xa8000 0x40>;
			reg-names = "phy_base";
			resets = <&gcc USB2_HSPHY_POR_ARES>, <&gcc USB2_HSPHY_S_ARES>;
			reset-names = "por_rst", "srif_rst";
			qca,host = <1>;
			qca,emulation = <0>;
			status = "disabled";
		};

		usb3: usb3@8a00000 {
			compatible = "qca,dwc3";
			#address-cells = <1>;
			#size-cells = <1>;
			ranges;
			reg = <0x8af8800 0x100>;
			reg-names = "qscratch_base";
			clocks = <&gcc GCC_USB3_MASTER_CLK>,
				<&gcc GCC_USB3_SLEEP_CLK>,
				<&gcc GCC_USB3_MOCK_UTMI_CLK>;
			clock-names = "master",
				"sleep",
				"mock_utmi";
			qca,host = <1>;
			status = "disabled";

			dwc3@8a00000 {
				compatible = "snps,dwc3";
				reg = <0x8a00000 0xf8000>;
				interrupts = <0 132 0>;
				usb-phy = <&usb3_hs_phy>, <&usb3_ss_phy>;
				phy-names = "usb2-phy", "usb3-phy";
				tx-fifo-resize;
				dr_mode = "host";
				usb2-susphy-quirk;
				usb2-host-discon-quirk;
				usb2-host-discon-phy-misc-reg = <0x24>;
				usb2-host-discon-mask = <0x100>;
			};
		};

		usb2: usb2@6000000 {
			compatible = "qca,dwc3";
			#address-cells = <1>;
			#size-cells = <1>;
			ranges;
			reg = <0x60f8800 0x100>;
			reg-names = "qscratch_base";
			clocks = <&gcc GCC_USB2_MASTER_CLK>,
				<&gcc GCC_USB2_SLEEP_CLK>,
				<&gcc GCC_USB2_MOCK_UTMI_CLK>;
			clock-names = "master",
				"sleep",
				"mock_utmi";
			qca,host = <1>;
			status = "disabled";

			dwc3@6000000 {
				compatible = "snps,dwc3";
				reg = <0x6000000 0xf8000>;
				interrupts = <0 136 0>;
				usb-phy = <&usb2_hs_phy>, <&dummy_ss_phy>;
				phy-names = "usb2-phy", "usb3-phy";
				tx-fifo-resize;
				dr_mode = "host";
				usb2-susphy-quirk;
				usb2-host-discon-quirk;
				usb2-host-discon-phy-misc-reg = <0x24>;
				usb2-host-discon-mask = <0x100>;
			};
		};
#+end_src
* Qualcomm MSM pseudo random number generator
=Documentation/devicetree/bindings/rng/qcom,prng.txt=

#+begin_src sh
		rng@0x00022000 {
			compatible = "qcom,prng";
			reg = <0x00022000 0x140>;
			clocks = <&gcc GCC_PRNG_AHB_CLK>;
			clock-names = "core";
		};
#+end_src
* Qualcomm I2C controller
=Documentation/devicetree/bindings/i2c/i2c-msm-v2.txt=
#+begin_src sh
		i2c_0: i2c@78b7000 { /* BLSP1 QUP2 */
			compatible = "qcom,i2c-msm-v2";
			#address-cells = <1>;
			#size-cells = <0>;
			reg-names = "qup_phys_addr", "bam_phys_addr";
			reg = <0x78b7000 0x600>,
				<0x7884000 0x23000>;
			interrupt-names = "qup_irq", "bam_irq";
			interrupts = <0 97 0>, <0 238 0>;
			clocks = <&gcc GCC_BLSP1_AHB_CLK>,
				<&gcc GCC_BLSP1_QUP1_I2C_APPS_CLK>;
			clock-names = "iface_clk", "core_clk";
			qcom,clk-freq-out = <100000>;
			qcom,clk-freq-in  = <19050000>;
			qcom,noise-rjct-scl = <0>;
			qcom,noise-rjct-sda = <0>;
			qcom,bam-pipe-idx-cons = <8>;
			qcom,bam-pipe-idx-prod = <9>;
			qcom,master-id = <0>;
			status = "disabled";
		};
#+end_src
