public_html/Embedded-System/Qcom-ipq40xx/ipq40xx-device-tree-overview.html
<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16">Qualcomm Atheros SuperSpeed DWC3 USB SoC controller</h2>
<div class="outline-text-2" id="text-16">
<p>
<code>Documentation/devicetree/bindings/usb/qca,dwc3.txt</code>
</p>
<ul class="org-ul">
<li>QCA BALDUR Highspeed USB PHY
</li>
<li>QCA UNI Superspeed USB PHY
</li>
<li>QCA DUMMY Superspeed USB PHY
</li>
<li>QCA DWC3 controller wrapper
</li>
</ul>

<div class="org-src-container">

<pre class="src src-sh">usb3_ss_phy: ssphy@0 {
        <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"qca,uni-ssphy"</span>;
        <span style="color: #eedd82;">reg</span> = &lt;0x9a000 0x800&gt;;
        reg-names = <span style="color: #ffa07a;">"phy_base"</span>;
        <span style="color: #eedd82;">resets</span> = &lt;&amp;gcc USB3_UNIPHY_PHY_ARES&gt;;
        reset-names = <span style="color: #ffa07a;">"por_rst"</span>;
        qca,<span style="color: #eedd82;">host</span> = &lt;1&gt;;
        qca,<span style="color: #eedd82;">emulation</span> = &lt;0&gt;;
        <span style="color: #eedd82;">status</span> = <span style="color: #ffa07a;">"disabled"</span>;
};

dummy_ss_phy: ssphy@1 {
        <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"qca,dummy-ssphy"</span>;
        <span style="color: #eedd82;">status</span> = <span style="color: #ffa07a;">"disabled"</span>;
};

usb3_hs_phy: hsphy@a6000 {
        <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"qca,baldur-usb3-hsphy"</span>;
        <span style="color: #eedd82;">reg</span> = &lt;0xa6000 0x40&gt;;
        reg-names = <span style="color: #ffa07a;">"phy_base"</span>;
        <span style="color: #eedd82;">resets</span> = &lt;&amp;gcc USB3_HSPHY_POR_ARES&gt;, &lt;&amp;gcc USB3_HSPHY_S_ARES&gt;;
        reset-names = <span style="color: #ffa07a;">"por_rst"</span>, <span style="color: #ffa07a;">"srif_rst"</span>;
        qca,<span style="color: #eedd82;">host</span> = &lt;1&gt;;
        qca,<span style="color: #eedd82;">emulation</span> = &lt;0&gt;;
        <span style="color: #eedd82;">status</span> = <span style="color: #ffa07a;">"disabled"</span>;
};

usb2_hs_phy: hsphy@a8000 {
        <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"qca,baldur-usb2-hsphy"</span>;
        <span style="color: #eedd82;">reg</span> = &lt;0xa8000 0x40&gt;;
        reg-names = <span style="color: #ffa07a;">"phy_base"</span>;
        <span style="color: #eedd82;">resets</span> = &lt;&amp;gcc USB2_HSPHY_POR_ARES&gt;, &lt;&amp;gcc USB2_HSPHY_S_ARES&gt;;
        reset-names = <span style="color: #ffa07a;">"por_rst"</span>, <span style="color: #ffa07a;">"srif_rst"</span>;
        qca,<span style="color: #eedd82;">host</span> = &lt;1&gt;;
        qca,<span style="color: #eedd82;">emulation</span> = &lt;0&gt;;
        <span style="color: #eedd82;">status</span> = <span style="color: #ffa07a;">"disabled"</span>;
};

usb3: usb3@8a00000 {
        <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"qca,dwc3"</span>;
        <span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">address-cells = &lt;1&gt;;</span>
        <span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">size-cells = &lt;1&gt;;</span>
        ranges;
        <span style="color: #eedd82;">reg</span> = &lt;0x8af8800 0x100&gt;;
        reg-names = <span style="color: #ffa07a;">"qscratch_base"</span>;
        <span style="color: #eedd82;">clocks</span> = &lt;&amp;gcc GCC_USB3_MASTER_CLK&gt;,
                &lt;&amp;gcc GCC_USB3_SLEEP_CLK&gt;,
                &lt;&amp;gcc GCC_USB3_MOCK_UTMI_CLK&gt;;
        clock-names = <span style="color: #ffa07a;">"master"</span>,
                <span style="color: #ffa07a;">"sleep"</span>,
                <span style="color: #ffa07a;">"mock_utmi"</span>;
        qca,<span style="color: #eedd82;">host</span> = &lt;1&gt;;
        <span style="color: #eedd82;">status</span> = <span style="color: #ffa07a;">"disabled"</span>;

        dwc3@8a00000 {
                <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"snps,dwc3"</span>;
                <span style="color: #eedd82;">reg</span> = &lt;0x8a00000 0xf8000&gt;;
                <span style="color: #eedd82;">interrupts</span> = &lt;0 132 0&gt;;
                usb-phy = &lt;&amp;usb3_hs_phy&gt;, &lt;&amp;usb3_ss_phy&gt;;
                phy-names = <span style="color: #ffa07a;">"usb2-phy"</span>, <span style="color: #ffa07a;">"usb3-phy"</span>;
                tx-fifo-resize;
                <span style="color: #eedd82;">dr_mode</span> = <span style="color: #ffa07a;">"host"</span>;
                usb2-susphy-quirk;
                usb2-host-discon-quirk;
                usb2-host-discon-phy-misc-reg = &lt;0x24&gt;;
                usb2-host-discon-mask = &lt;0x100&gt;;
        };
};

usb2: usb2@6000000 {
        <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"qca,dwc3"</span>;
        <span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">address-cells = &lt;1&gt;;</span>
        <span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">size-cells = &lt;1&gt;;</span>
        ranges;
        <span style="color: #eedd82;">reg</span> = &lt;0x60f8800 0x100&gt;;
        reg-names = <span style="color: #ffa07a;">"qscratch_base"</span>;
        <span style="color: #eedd82;">clocks</span> = &lt;&amp;gcc GCC_USB2_MASTER_CLK&gt;,
                &lt;&amp;gcc GCC_USB2_SLEEP_CLK&gt;,
                &lt;&amp;gcc GCC_USB2_MOCK_UTMI_CLK&gt;;
        clock-names = <span style="color: #ffa07a;">"master"</span>,
                <span style="color: #ffa07a;">"sleep"</span>,
                <span style="color: #ffa07a;">"mock_utmi"</span>;
        qca,<span style="color: #eedd82;">host</span> = &lt;1&gt;;
        <span style="color: #eedd82;">status</span> = <span style="color: #ffa07a;">"disabled"</span>;

        dwc3@6000000 {
                <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"snps,dwc3"</span>;
                <span style="color: #eedd82;">reg</span> = &lt;0x6000000 0xf8000&gt;;
                <span style="color: #eedd82;">interrupts</span> = &lt;0 136 0&gt;;
                usb-phy = &lt;&amp;usb2_hs_phy&gt;, &lt;&amp;dummy_ss_phy&gt;;
                phy-names = <span style="color: #ffa07a;">"usb2-phy"</span>, <span style="color: #ffa07a;">"usb3-phy"</span>;
                tx-fifo-resize;
                <span style="color: #eedd82;">dr_mode</span> = <span style="color: #ffa07a;">"host"</span>;
                usb2-susphy-quirk;
                usb2-host-discon-quirk;
                usb2-host-discon-phy-misc-reg = &lt;0x24&gt;;
                usb2-host-discon-mask = &lt;0x100&gt;;
        };
};
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-17" class="outline-2">
<h2 id="sec-17">Qualcomm MSM pseudo random number generator</h2>
<div class="outline-text-2" id="text-17">
<p>
<code>Documentation/devicetree/bindings/rng/qcom,prng.txt</code>
</p>

<div class="org-src-container">

<pre class="src src-sh">rng@0x00022000 {
        <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"qcom,prng"</span>;
        <span style="color: #eedd82;">reg</span> = &lt;0x00022000 0x140&gt;;
        <span style="color: #eedd82;">clocks</span> = &lt;&amp;gcc GCC_PRNG_AHB_CLK&gt;;
        clock-names = <span style="color: #ffa07a;">"core"</span>;
};
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-18" class="outline-2">
<h2 id="sec-18">Qualcomm I2C controller</h2>
<div class="outline-text-2" id="text-18">
<p>
<code>Documentation/devicetree/bindings/i2c/i2c-msm-v2.txt</code>
</p>
<div class="org-src-container">

<pre class="src src-sh">i2c_0: i2c@78b7000 { /* BLSP1 QUP2 */
        <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"qcom,i2c-msm-v2"</span>;
        <span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">address-cells = &lt;1&gt;;</span>
        <span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">size-cells = &lt;0&gt;;</span>
        reg-names = <span style="color: #ffa07a;">"qup_phys_addr"</span>, <span style="color: #ffa07a;">"bam_phys_addr"</span>;
        <span style="color: #eedd82;">reg</span> = &lt;0x78b7000 0x600&gt;,
                &lt;0x7884000 0x23000&gt;;
        interrupt-names = <span style="color: #ffa07a;">"qup_irq"</span>, <span style="color: #ffa07a;">"bam_irq"</span>;
        <span style="color: #eedd82;">interrupts</span> = &lt;0 97 0&gt;, &lt;0 238 0&gt;;
        <span style="color: #eedd82;">clocks</span> = &lt;&amp;gcc GCC_BLSP1_AHB_CLK&gt;,
                &lt;&amp;gcc GCC_BLSP1_QUP1_I2C_APPS_CLK&gt;;
        clock-names = <span style="color: #ffa07a;">"iface_clk"</span>, <span style="color: #ffa07a;">"core_clk"</span>;
        qcom,clk-freq-out = &lt;100000&gt;;
        qcom,clk-freq-in  = &lt;19050000&gt;;
        qcom,noise-rjct-scl = &lt;0&gt;;
        qcom,noise-rjct-sda = &lt;0&gt;;
        qcom,bam-pipe-idx-cons = &lt;8&gt;;
        qcom,bam-pipe-idx-prod = &lt;9&gt;;
        qcom,master-id = &lt;0&gt;;
        <span style="color: #eedd82;">status</span> = <span style="color: #ffa07a;">"disabled"</span>;
};
</pre>
</div>
</div>
</div>
