public_html/Embedded-System/Qcom-ipq40xx/ipq40xx-device-tree-overview.html
<div id="outline-container-sec-19" class="outline-2">
<h2 id="sec-19">QCEDEV and QCRYPTO</h2>
<div class="outline-text-2" id="text-19">
<ul class="org-ul">
<li><code>Documentation/devicetree/bindings/crypto/msm/qcedev.txt</code>
</li>
<li><code>Documentation/devicetree/bindings/crypto/msm/qcrypto.txt</code>
</li>
</ul>

<div class="org-src-container">

<pre class="src src-sh">qcom_crypto: qcrypto@8e20000 {
                        <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"qcom,qcrypto"</span>;
                        <span style="color: #eedd82;">reg</span> = &lt;0x8e20000 0x20000&gt;,
                                &lt;0x8e04000 0x20000&gt;;
                        reg-names = <span style="color: #ffa07a;">"crypto-base"</span>,<span style="color: #ffa07a;">"crypto-bam-base"</span>;
                        <span style="color: #eedd82;">interrupts</span> = &lt;0 207 0&gt;;
                        qcom,bam-pipe-pair = &lt;1&gt;;
                        qcom,ce-hw-instance = &lt;0&gt;;
                        qcom,ce-hw-shared = &lt;1&gt;;
                        qcom,ce-device = &lt;0&gt;;
                        qcom,ce-opp-freq= &lt;125000000&gt;;
                        <span style="color: #eedd82;">clocks</span> = &lt;&amp;gcc GCC_CRYPTO_CLK&gt;,
                                &lt;&amp;gcc GCC_CRYPTO_AXI_CLK&gt;,
                                &lt;&amp;gcc GCC_CRYPTO_AHB_CLK&gt;;

                        clock-names = <span style="color: #ffa07a;">"core_clk"</span>, <span style="color: #ffa07a;">"bus_clk"</span>, <span style="color: #ffa07a;">"iface_clk"</span>;
                        <span style="color: #eedd82;">status</span> = <span style="color: #ffa07a;">"disabled"</span>;
                };

                qcom_cedev: qcedev@8e20000 {
                        <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"qcom,qcedev"</span>;
                        <span style="color: #eedd82;">reg</span> = &lt;0x8e20000  0x20000&gt;,
                                &lt;0x8e04000  0x20000&gt;;
                        reg-names = <span style="color: #ffa07a;">"crypto-base"</span>,<span style="color: #ffa07a;">"crypto-bam-base"</span>;
                        <span style="color: #eedd82;">interrupts</span> = &lt;0 207 0&gt;;
                        qcom,bam-pipe-pair = &lt;1&gt;;
                        qcom,ce-hw-instance = &lt;0&gt;;
                        qcom,ce-hw-shared = &lt;1&gt;;
                        qcom,ce-device = &lt;0&gt;;
                        qcom,ce-opp-freq= &lt;125000000&gt;;
                        <span style="color: #eedd82;">clocks</span> = &lt;&amp;gcc GCC_CRYPTO_CLK&gt;,
                                &lt;&amp;gcc GCC_CRYPTO_AXI_CLK&gt;,
                                &lt;&amp;gcc GCC_CRYPTO_AHB_CLK&gt;;

                        clock-names = <span style="color: #ffa07a;">"core_clk"</span>, <span style="color: #ffa07a;">"bus_clk"</span>, <span style="color: #ffa07a;">"iface_clk"</span>;
                        <span style="color: #eedd82;">status</span> = <span style="color: #ffa07a;">"disabled"</span>;
                };
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-20" class="outline-2">
<h2 id="sec-20">QCA WLAN Driver</h2>
<div class="outline-text-2" id="text-20">
<p>
<code>Documentation/devicetree/bindings/qca/wlan.txt</code>
</p>

<div class="org-src-container">

<pre class="src src-sh">wifi_glb_tcsr: tcsr@1949000 {
        <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"qcom,tcsr"</span>;
        <span style="color: #eedd82;">reg</span> = &lt;0x1949000 0x100&gt;;
        qcom,<span style="color: #eedd82;">wifi_glb_cfg</span> = &lt;TCSR_WIFI_GLB_CFG&gt;;
};

wifi_noc_memtype_m0_m2_tcsr: tcsr@1957000 {
        <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"qcom,tcsr"</span>;
        <span style="color: #eedd82;">reg</span> = &lt;0x1957000 0x100&gt;;
        qcom,<span style="color: #eedd82;">wifi_noc_memtype_m0_m2</span> = &lt;TCSR_WIFI_NOC_MEMTYPE_M0_M2&gt;;
};

wifi0: wifi@a000000 {
        <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"qca,wifi-ipq40xx"</span>;
        <span style="color: #eedd82;">reg</span> = &lt;0xa000000 0x200000&gt;;
        core-id = &lt;0x0&gt;;
        <span style="color: #eedd82;">resets</span> = &lt;&amp;gcc WIFI0_CPU_INIT_RESET&gt;,
                &lt;&amp;gcc WIFI0_RADIO_SRIF_RESET&gt;,
                &lt;&amp;gcc WIFI0_RADIO_WARM_RESET&gt;,
                &lt;&amp;gcc WIFI0_RADIO_COLD_RESET&gt;,
                &lt;&amp;gcc WIFI0_CORE_WARM_RESET&gt;,
                &lt;&amp;gcc WIFI0_CORE_COLD_RESET&gt;;
        reset-names = <span style="color: #ffa07a;">"wifi_cpu_init"</span>,
                <span style="color: #ffa07a;">"wifi_radio_srif"</span>,
                <span style="color: #ffa07a;">"wifi_radio_warm"</span>,
                <span style="color: #ffa07a;">"wifi_radio_cold"</span>,
                <span style="color: #ffa07a;">"wifi_core_warm"</span>,
                <span style="color: #ffa07a;">"wifi_core_cold"</span>;
        <span style="color: #eedd82;">clocks</span> = &lt;&amp;gcc GCC_WCSS2G_CLK&gt;,
                &lt;&amp;gcc GCC_WCSS2G_REF_CLK&gt;,
                &lt;&amp;gcc GCC_WCSS2G_RTC_CLK&gt;;
        clock-names = <span style="color: #ffa07a;">"wifi_wcss_cmd"</span>, <span style="color: #ffa07a;">"wifi_wcss_ref"</span>, <span style="color: #ffa07a;">"wifi_wcss_rtc"</span>;
        <span style="color: #eedd82;">interrupts</span> = &lt;0 0x20 0x1&gt;,
                &lt;0 0x21 0x1&gt;,
                &lt;0 0x22 0x1&gt;,
                &lt;0 0x23 0x1&gt;,
                &lt;0 0x24 0x1&gt;,
                &lt;0 0x25 0x1&gt;,
                &lt;0 0x26 0x1&gt;,
                &lt;0 0x27 0x1&gt;,
                &lt;0 0x28 0x1&gt;,
                &lt;0 0x29 0x1&gt;,
                &lt;0 0x2a 0x1&gt;,
                &lt;0 0x2b 0x1&gt;,
                &lt;0 0x2c 0x1&gt;,
                &lt;0 0x2d 0x1&gt;,
                &lt;0 0x2e 0x1&gt;,
                &lt;0 0x2f 0x1&gt;,
                &lt;0 0xa8 0x0&gt;;
        interrupt-names = <span style="color: #ffa07a;">"msi0"</span>, <span style="color: #ffa07a;">"msi1"</span>, <span style="color: #ffa07a;">"msi2"</span>, <span style="color: #ffa07a;">"msi3"</span>, <span style="color: #ffa07a;">"msi4"</span>, <span style="color: #ffa07a;">"msi5"</span>, <span style="color: #ffa07a;">"msi6"</span>,
                <span style="color: #ffa07a;">"msi7"</span>, <span style="color: #ffa07a;">"msi8"</span>, <span style="color: #ffa07a;">"msi9"</span>, <span style="color: #ffa07a;">"msi10"</span>, <span style="color: #ffa07a;">"msi11"</span>, <span style="color: #ffa07a;">"msi12"</span>, <span style="color: #ffa07a;">"msi13"</span>, <span style="color: #ffa07a;">"msi14"</span>,
                <span style="color: #ffa07a;">"msi15"</span>, <span style="color: #ffa07a;">"legacy"</span>;
        <span style="color: #eedd82;">status</span> = <span style="color: #ffa07a;">"ok"</span>;
        qca,<span style="color: #eedd82;">msi_addr</span> = &lt;0x0b006040&gt;;
        qca,<span style="color: #eedd82;">msi_base</span> = &lt;0x40&gt;;
};

wifi1: wifi@a800000 {
        <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"qca,wifi-ipq40xx"</span>;
        <span style="color: #eedd82;">reg</span> = &lt;0xa800000 0x200000&gt;;
        core-id = &lt;0x1&gt;;
        <span style="color: #eedd82;">resets</span> = &lt;&amp;gcc WIFI1_CPU_INIT_RESET&gt;,
                &lt;&amp;gcc WIFI1_RADIO_SRIF_RESET&gt;,
                &lt;&amp;gcc WIFI1_RADIO_WARM_RESET&gt;,
                &lt;&amp;gcc WIFI1_RADIO_COLD_RESET&gt;,
                &lt;&amp;gcc WIFI1_CORE_WARM_RESET&gt;,
                &lt;&amp;gcc WIFI1_CORE_COLD_RESET&gt;;
        reset-names = <span style="color: #ffa07a;">"wifi_cpu_init"</span>,
                <span style="color: #ffa07a;">"wifi_radio_srif"</span>,
                <span style="color: #ffa07a;">"wifi_radio_warm"</span>,
                <span style="color: #ffa07a;">"wifi_radio_cold"</span>,
                <span style="color: #ffa07a;">"wifi_core_warm"</span>,
                <span style="color: #ffa07a;">"wifi_core_cold"</span>;
        <span style="color: #eedd82;">clocks</span> = &lt;&amp;gcc GCC_WCSS5G_CLK&gt;,
                &lt;&amp;gcc GCC_WCSS5G_REF_CLK&gt;,
                &lt;&amp;gcc GCC_WCSS5G_RTC_CLK&gt;;
        clock-names = <span style="color: #ffa07a;">"wifi_wcss_cmd"</span>, <span style="color: #ffa07a;">"wifi_wcss_ref"</span>, <span style="color: #ffa07a;">"wifi_wcss_rtc"</span>;
        <span style="color: #eedd82;">interrupts</span> = &lt;0 0x30 0x1&gt;,
                &lt;0 0x31 0x1&gt;,
                &lt;0 0x32 0x1&gt;,
                &lt;0 0x33 0x1&gt;,
                &lt;0 0x34 0x1&gt;,
                &lt;0 0x35 0x1&gt;,
                &lt;0 0x36 0x1&gt;,
                &lt;0 0x37 0x1&gt;,
                &lt;0 0x38 0x1&gt;,
                &lt;0 0x39 0x1&gt;,
                &lt;0 0x3a 0x1&gt;,
                &lt;0 0x3b 0x1&gt;,
                &lt;0 0x3c 0x1&gt;,
                &lt;0 0x3d 0x1&gt;,
                &lt;0 0x3e 0x1&gt;,
                &lt;0 0x3f 0x1&gt;,
                &lt;0 0xa9 0x0&gt;;
        interrupt-names = <span style="color: #ffa07a;">"msi0"</span>, <span style="color: #ffa07a;">"msi1"</span>, <span style="color: #ffa07a;">"msi2"</span>, <span style="color: #ffa07a;">"msi3"</span>, <span style="color: #ffa07a;">"msi4"</span>, <span style="color: #ffa07a;">"msi5"</span>, <span style="color: #ffa07a;">"msi6"</span>,
                <span style="color: #ffa07a;">"msi7"</span>, <span style="color: #ffa07a;">"msi8"</span>, <span style="color: #ffa07a;">"msi9"</span>, <span style="color: #ffa07a;">"msi10"</span>, <span style="color: #ffa07a;">"msi11"</span>, <span style="color: #ffa07a;">"msi12"</span>, <span style="color: #ffa07a;">"msi13"</span>, <span style="color: #ffa07a;">"msi14"</span>,
                <span style="color: #ffa07a;">"msi15"</span>, <span style="color: #ffa07a;">"legacy"</span>;
        <span style="color: #eedd82;">status</span> = <span style="color: #ffa07a;">"ok"</span>;
        qca,<span style="color: #eedd82;">msi_addr</span> = &lt;0x0b006040&gt;;
        qca,<span style="color: #eedd82;">msi_base</span> = &lt;0x50&gt;;
};
</pre>
</div>
</div>
</div>
