public_html/Embedded-System/Qcom-ipq40xx/ipq40xx-device-tree-overview.html
<div id="outline-container-sec-21" class="outline-2">
<h2 id="sec-21">QCA Ethernet Subsystem</h2>
<div class="outline-text-2" id="text-21">
<ol class="org-ol">
<li>QCA Ethernet DMA
<code>Documentation/devicetree/bindings/net/qca-ess.txt</code>
</li>
<li>QCA Ethernet Switch
ESS-SWITCH is used to forward the packet among LAN, WAN and Host
processor.
<code>Documentation/devicetree/bindings/arm/msm/ess-switch.txt</code>
</li>
<li>QCA Ethernet PHY mode <code>ess-psgmii</code>
</li>
<li>MDIO Interface <code>ipq40xx-mdio</code>
</li>
</ol>

<div class="org-src-container">

<pre class="src src-sh">edma@c080000 {
        <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"qcom,ess-edma"</span>;
        <span style="color: #eedd82;">reg</span> = &lt;0xc080000 0x8000&gt;;
        qcom,page-mode = &lt;0&gt;;
        qcom,<span style="color: #eedd82;">rx_head_buf_size</span> = &lt;1540&gt;;
        qcom,<span style="color: #eedd82;">wan_port_id_mask</span> = &lt;0x10&gt;;
        qcom,mdio_supported;
        qcom,<span style="color: #eedd82;">phy_mdio_addr</span> = &lt;4&gt;;
        qcom,<span style="color: #eedd82;">poll_required</span> = &lt;1&gt;;
        qcom,<span style="color: #eedd82;">forced_speed</span> = &lt;1000&gt;;
        qcom,<span style="color: #eedd82;">forced_duplex</span> = &lt;1&gt;;

        <span style="color: #eedd82;">interrupts</span> = &lt;0 65 1&gt;,
                        &lt;0 66 1&gt;,
                        &lt;0 67 1&gt;,
                        &lt;0 68 1&gt;,
                        &lt;0 69 1&gt;,
                        &lt;0 70 1&gt;,
                        &lt;0 71 1&gt;,
                        &lt;0 72 1&gt;,
                        &lt;0 73 1&gt;,
                        &lt;0 74 1&gt;,
                        &lt;0 75 1&gt;,
                        &lt;0 76 1&gt;,
                        &lt;0 77 1&gt;,
                        &lt;0 78 1&gt;,
                        &lt;0 79 1&gt;,
                        &lt;0 80 1&gt;,
                        &lt;0 240 1&gt;,
                        &lt;0 241 1&gt;,
                        &lt;0 242 1&gt;,
                        &lt;0 243 1&gt;,
                        &lt;0 244 1&gt;,
                        &lt;0 245 1&gt;,
                        &lt;0 246 1&gt;,
                        &lt;0 247 1&gt;,
                        &lt;0 248 1&gt;,
                        &lt;0 249 1&gt;,
                        &lt;0 250 1&gt;,
                        &lt;0 251 1&gt;,
                        &lt;0 252 1&gt;,
                        &lt;0 253 1&gt;,
                        &lt;0 254 1&gt;,
                        &lt;0 255 1&gt;;
        gmac0 {
                local-mac-address = [000000000000];
        };
        gmac1 {
                local-mac-address = [000000000000];
        };
};

ess-switch@c000000 {
        <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"qcom,ess-switch"</span>;
        <span style="color: #eedd82;">reg</span> = &lt;0xc000000 0x80000&gt;; /* 512KB */
        <span style="color: #eedd82;">switch_access_mode</span> = <span style="color: #ffa07a;">"local bus"</span>;
        <span style="color: #eedd82;">resets</span> = &lt;&amp;gcc ESS_RESET&gt;, &lt;&amp;gcc ESS_MAC1_CLK_DIS&gt;, <span style="color: #ffa07a;">\</span>
                &lt;&amp;gcc ESS_MAC2_CLK_DIS&gt;, &lt;&amp;gcc ESS_MAC3_CLK_DIS&gt;, <span style="color: #ffa07a;">\</span>
                &lt;&amp;gcc ESS_MAC4_CLK_DIS&gt;, &lt;&amp;gcc ESS_MAC5_CLK_DIS&gt;;
        reset-names = <span style="color: #ffa07a;">"ess_rst"</span>,<span style="color: #ffa07a;">"ess_mac1_clk_dis"</span>, <span style="color: #ffa07a;">\</span>
                <span style="color: #ffa07a;">"ess_mac2_clk_dis"</span>,<span style="color: #ffa07a;">"ess_mac3_clk_dis"</span>, <span style="color: #ffa07a;">\</span>
                <span style="color: #ffa07a;">"ess_mac4_clk_dis"</span>, <span style="color: #ffa07a;">"ess_mac5_clk_dis"</span>;
        <span style="color: #eedd82;">clocks</span> = &lt;&amp;gcc GCC_ESS_CLK&gt;;
        clock-names = <span style="color: #ffa07a;">"ess_clk"</span>;
        <span style="color: #eedd82;">switch_cpu_bmp</span> = &lt;0x1&gt;;  /* cpu port bitmap */
        <span style="color: #eedd82;">switch_lan_bmp</span> = &lt;0x1e&gt;; /* lan port bitmap */
        <span style="color: #eedd82;">switch_wan_bmp</span> = &lt;0x20&gt;; /* wan port bitmap */
};
ess-psgmii@98000 {
        <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"qcom,ess-psgmii"</span>;
        <span style="color: #eedd82;">reg</span> = &lt;0x98000 0x800&gt;; /* 2k */
        <span style="color: #eedd82;">psgmii_access_mode</span> = <span style="color: #ffa07a;">"local bus"</span>;
        <span style="color: #eedd82;">resets</span> = &lt;&amp;gcc ESS_PSGMII_ARES&gt;;
        reset-names = <span style="color: #ffa07a;">"psgmii_rst"</span>;
};

mdio@90000 {
        <span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">address-cells = &lt;1&gt;;</span>
        <span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">size-cells = &lt;1&gt;;</span>
        <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"qcom,ipq40xx-mdio"</span>;
        <span style="color: #eedd82;">reg</span> = &lt;0x90000 0x64&gt;;
        phy0: ethernet-phy@0 {
                <span style="color: #eedd82;">reg</span> = &lt;0&gt;;
        };
        phy1: ethernet-phy@1 {
                <span style="color: #eedd82;">reg</span> = &lt;1&gt;;
        };
        phy2: ethernet-phy@2 {
                <span style="color: #eedd82;">reg</span> = &lt;2&gt;;
        };
        phy3: ethernet-phy@3 {
                <span style="color: #eedd82;">reg</span> = &lt;3&gt;;
        };
        phy4: ethernet-phy@4 {
                <span style="color: #eedd82;">reg</span> = &lt;4&gt;;
        };
};
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-22" class="outline-2">
<h2 id="sec-22">MSM PCIe</h2>
<div class="outline-text-2" id="text-22">
<p>
<code>Documentation/devicetree/bindings/pci/msm_pcie.txt</code>
</p>

<div class="org-src-container">

<pre class="src src-sh">pcie0: qcom,pcie@80000 {
        <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"qcom,msm_pcie"</span>;
        cell-index = &lt;0&gt;;
        qcom,ctrl-amt = &lt;1&gt;;

        <span style="color: #eedd82;">reg</span> = &lt;0x80000 0x2000&gt;,
              &lt;0x99000 0x800&gt;,
              &lt;0x40000000 0xf1d&gt;,
              &lt;0x40000f20 0xa8&gt;,
              &lt;0x40100000 0x1000&gt;,
              &lt;0x40200000 0x100000&gt;,
              &lt;0x40300000 0xd00000&gt;;
        reg-names = <span style="color: #ffa07a;">"parf"</span>, <span style="color: #ffa07a;">"phy"</span>, <span style="color: #ffa07a;">"dm_core"</span>, <span style="color: #ffa07a;">"elbi"</span>,
                <span style="color: #ffa07a;">"conf"</span>, <span style="color: #ffa07a;">"io"</span>, <span style="color: #ffa07a;">"bars"</span>;

        <span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">address-cells = &lt;0&gt;;</span>
        interrupt-parent = &lt;&amp;pcie0&gt;;
        <span style="color: #eedd82;">interrupts</span> = &lt;0 1 2 3 4 5 6 7 8 9 10 11 12&gt;;
        <span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">interrupt-cells = &lt;1&gt;;</span>
        interrupt-map-mask = &lt;0xffffffff&gt;;
        interrupt-map = &lt;0 &amp;intc 0 141 0
                1 &amp;intc 0 142 0
                2 &amp;intc 0 143 0
                3 &amp;intc 0 144 0
                4 &amp;intc 0 145 0
                5 &amp;intc 0 146 0
                6 &amp;intc 0 147 0
                7 &amp;intc 0 148 0
                8 &amp;intc 0 149 0
                9 &amp;intc 0 150 0
                10 &amp;intc 0 151 0
                11 &amp;intc 0 152 0 &gt;;

        interrupt-names = <span style="color: #ffa07a;">"int_msi"</span>, <span style="color: #ffa07a;">"int_a"</span>, <span style="color: #ffa07a;">"int_b"</span>, <span style="color: #ffa07a;">"int_c"</span>, <span style="color: #ffa07a;">"int_d"</span>,
                <span style="color: #ffa07a;">"int_pls_pme"</span>, <span style="color: #ffa07a;">"int_pme_legacy"</span>, <span style="color: #ffa07a;">"int_pls_err"</span>,
                <span style="color: #ffa07a;">"int_aer_legacy"</span>, <span style="color: #ffa07a;">"int_pls_link_up"</span>,
                <span style="color: #ffa07a;">"int_pls_link_down"</span>, <span style="color: #ffa07a;">"int_bridge_flush_n"</span>,<span style="color: #ffa07a;">"int_wake"</span>;

        qcom,ep-latency = &lt;10&gt;;

        <span style="color: #eedd82;">clocks</span> = &lt;&amp;gcc GCC_PCIE_AHB_CLK&gt;,
                &lt;&amp;gcc GCC_PCIE_AXI_M_CLK&gt;,
                &lt;&amp;gcc GCC_PCIE_AXI_S_CLK&gt;;

        clock-names =   <span style="color: #ffa07a;">"pcie_0_cfg_ahb_clk"</span>,
                        <span style="color: #ffa07a;">"pcie_0_mstr_axi_clk"</span>,
                        <span style="color: #ffa07a;">"pcie_0_slv_axi_clk"</span>;

        max-clock-frequency-hz = &lt;0&gt;, &lt;0&gt;, &lt;0&gt;;

        <span style="color: #eedd82;">resets</span> = &lt;&amp;gcc PCIE_AXI_M_ARES&gt;,
                &lt;&amp;gcc PCIE_AXI_S_ARES&gt;,
                &lt;&amp;gcc PCIE_PIPE_ARES&gt;,
                &lt;&amp;gcc PCIE_AXI_M_VMIDMT_ARES&gt;,
                &lt;&amp;gcc PCIE_AXI_S_XPU_ARES&gt;,
                &lt;&amp;gcc PCIE_PARF_XPU_ARES&gt;,
                &lt;&amp;gcc PCIE_PHY_ARES&gt;,
                &lt;&amp;gcc PCIE_AXI_M_STICKY_ARES&gt;,
                &lt;&amp;gcc PCIE_PIPE_STICKY_ARES&gt;,
                &lt;&amp;gcc PCIE_PWR_ARES&gt;,
                &lt;&amp;gcc PCIE_AHB_ARES&gt;,
                &lt;&amp;gcc PCIE_PHY_AHB_ARES&gt;;

        reset-names = <span style="color: #ffa07a;">"pcie_rst_axi_m_ares"</span>,
                <span style="color: #ffa07a;">"pcie_rst_axi_s_ares"</span>,
                <span style="color: #ffa07a;">"pcie_rst_pipe_ares"</span>,
                <span style="color: #ffa07a;">"pcie_rst_axi_m_vmidmt_ares"</span>,
                <span style="color: #ffa07a;">"pcie_rst_axi_s_xpu_ares"</span>,
                <span style="color: #ffa07a;">"pcie_rst_parf_xpu_ares"</span>,
                <span style="color: #ffa07a;">"pcie_rst_phy_ares"</span>,
                <span style="color: #ffa07a;">"pcie_rst_axi_m_sticky_ares"</span>,
                <span style="color: #ffa07a;">"pcie_rst_pipe_sticky_ares"</span>,
                <span style="color: #ffa07a;">"pcie_rst_pwr_ares"</span>,
                <span style="color: #ffa07a;">"pcie_rst_ahb_res"</span>,
                <span style="color: #ffa07a;">"pcie_rst_phy_ahb_ares"</span>;
        <span style="color: #eedd82;">status</span> = <span style="color: #ffa07a;">"disabled"</span>;
};
</pre>
</div>
</div>
</div>
