src/Embedded-System/Qcom-ipq40xx/ipq40xx-device-tree-overview.org
* QCA LED
=Documentation/devicetree/bindings/leds/leds-ipq40xx.txt=
#+begin_src sh
		qcom: ledc@1937000  {
			compatible = "qca,ledc";
			reg = <0x1937000 0x20070>;
			reg-names = "ledc_base_addr";
			qcom,tcsr_ledc_values = <0x320193 0x14720800 0x20d 0x0 \
				0x0 0xFFFFFFFF 0x0 0x7 0x7D0010 0x0 0x10482090 0x3FFFDFC>;
			qcom,ledc_blink_indices_cnt = <0>;
			qcom,ledc_blink_indices = <0>;
			status = "disabled";
		};
#+end_src
* ARM Performance Monitor Units
ARM cores often have a PMU for counting cpu and cache events like
cache misses and hits. The interface to the PMU is part of the ARM.

=Documentation/devicetree/bindings/arm/pmu.txt=
#+begin_src sh
		pmu {
			compatible = "arm,cortex-a7-pmu";
			interrupts = <1 7 0xf04>;
		};
#+end_src
* Qualcomm SDHCI controller (sdhci-msm)
=Documentation/devicetree/bindings/mmc/sdhci-msm.txt=

#+begin_src sh
		sdhci@7824000 {
			compatible = "qcom,sdhci-msm-v4";
			reg = <0x7824900 0x11c>, <0x7824000 0x800>;
			interrupts = <0 123 0>, <0 138 0>;
			bus-width = <8>;
			clocks = <&gcc GCC_SDCC1_APPS_CLK>, <&gcc GCC_SDCC1_AHB_CLK>;
			clock-names = "core", "iface";
			status = "disabled";
		};
#+end_src
* QCA SCM_RESTART_REASON
scm restart reason driver controls the collection of crashdump.

During panic/assert the notifiers registered in this driver will be
kicked in and the magic cookie is set, the crashdumps are collected in
apps bootloader.

=Documentation/devicetree/bindings/soc/qcom/qca,scm_restart_reason.txt=
#+begin_src sh
		qca,scm_restart_reason {
			compatible = "qca,scm_restart_reason";
		};
#+end_src
* cpufreq driver
IPQ40xx SoC cpufreq driver for CPU frequency scaling.

=Documentation/devicetree/bindings/cpufreq/cpufreq-qca.txt=
#+begin_src sh
		cpu_freq_ipq40xx {
			compatible = "qca,ipq40xx_freq";
			clock-latency = <100000>;
			qcom,cpufreq-table =
			< 48000 >,
			< 200000 >,
			< 500000 >,
			< 716000 >;
		};
#+end_src

* qcom-ipq40xx-ap.dk04.1

** uart1(serial)
=arch/arm/boot/dts/qcom-ipq40xx-hsuart.dtsi=

=msm-hsuart-v14=: =Documentation/devicetree/bindings/tty/serial/msm_serial_hs.txt=
#+begin_src sh
uart1:uart@78b0000 {
		compatible = "qcom,msm-hsuart-v14";
		reg = <0x78b0000 0x200>,
			<0x7884000 0x23000>;
		reg-names = "core_mem", "bam_mem";
		interrupt-names = "core_irq", "bam_irq";
		#address-cells = <0>;
		interrupt-parent = <&uart1>;
		interrupts = <0 1 2>;
		#interrupt-cells = <1>;
		interrupt-map-mask = <0xffffffff>;
		interrupt-map = <0 &intc 0 108 0
			1 &intc 0 238 0>;
		qcom,bam-tx-ep-pipe-index = <2>;
		qcom,bam-rx-ep-pipe-index = <3>;
		qcom,master-id = <86>;
		clocks = <&gcc GCC_BLSP1_AHB_CLK>,
			<&gcc GCC_BLSP1_UART2_APPS_CLK>;
		clock-names = "iface_clk", "core_clk";
		status = "disabled";
		};
#+end_src

