public_html/Embedded-System/Qcom-ipq40xx/ipq40xx-device-tree-overview.html
<div id="outline-container-sec-23" class="outline-2">
<h2 id="sec-23">QCA LED</h2>
<div class="outline-text-2" id="text-23">
<p>
<code>Documentation/devicetree/bindings/leds/leds-ipq40xx.txt</code>
</p>
<div class="org-src-container">

<pre class="src src-sh">qcom: ledc@1937000  {
        <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"qca,ledc"</span>;
        <span style="color: #eedd82;">reg</span> = &lt;0x1937000 0x20070&gt;;
        reg-names = <span style="color: #ffa07a;">"ledc_base_addr"</span>;
        qcom,<span style="color: #eedd82;">tcsr_ledc_values</span> = &lt;0x320193 0x14720800 0x20d 0x0 <span style="color: #ffa07a;">\</span>
                0x0 0xFFFFFFFF 0x0 0x7 0x7D0010 0x0 0x10482090 0x3FFFDFC&gt;;
        qcom,<span style="color: #eedd82;">ledc_blink_indices_cnt</span> = &lt;0&gt;;
        qcom,<span style="color: #eedd82;">ledc_blink_indices</span> = &lt;0&gt;;
        <span style="color: #eedd82;">status</span> = <span style="color: #ffa07a;">"disabled"</span>;
};
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-24" class="outline-2">
<h2 id="sec-24">ARM Performance Monitor Units</h2>
<div class="outline-text-2" id="text-24">
<p>
ARM cores often have a PMU for counting cpu and cache events like
cache misses and hits. The interface to the PMU is part of the ARM.
</p>

<p>
<code>Documentation/devicetree/bindings/arm/pmu.txt</code>
</p>
<div class="org-src-container">

<pre class="src src-sh">pmu {
        <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"arm,cortex-a7-pmu"</span>;
        <span style="color: #eedd82;">interrupts</span> = &lt;1 7 0xf04&gt;;
};
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-25" class="outline-2">
<h2 id="sec-25">Qualcomm SDHCI controller (sdhci-msm)</h2>
<div class="outline-text-2" id="text-25">
<p>
<code>Documentation/devicetree/bindings/mmc/sdhci-msm.txt</code>
</p>

<div class="org-src-container">

<pre class="src src-sh">sdhci@7824000 {
        <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"qcom,sdhci-msm-v4"</span>;
        <span style="color: #eedd82;">reg</span> = &lt;0x7824900 0x11c&gt;, &lt;0x7824000 0x800&gt;;
        <span style="color: #eedd82;">interrupts</span> = &lt;0 123 0&gt;, &lt;0 138 0&gt;;
        bus-width = &lt;8&gt;;
        <span style="color: #eedd82;">clocks</span> = &lt;&amp;gcc GCC_SDCC1_APPS_CLK&gt;, &lt;&amp;gcc GCC_SDCC1_AHB_CLK&gt;;
        clock-names = <span style="color: #ffa07a;">"core"</span>, <span style="color: #ffa07a;">"iface"</span>;
        <span style="color: #eedd82;">status</span> = <span style="color: #ffa07a;">"disabled"</span>;
};
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-26" class="outline-2">
<h2 id="sec-26">QCA SCM<sub>RESTART</sub><sub>REASON</sub></h2>
<div class="outline-text-2" id="text-26">
<p>
scm restart reason driver controls the collection of crashdump.
</p>

<p>
During panic/assert the notifiers registered in this driver will be
kicked in and the magic cookie is set, the crashdumps are collected in
apps bootloader.
</p>

<p>
<code>Documentation/devicetree/bindings/soc/qcom/qca,scm_restart_reason.txt</code>
</p>
<div class="org-src-container">

<pre class="src src-sh">qca,scm_restart_reason {
        <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"qca,scm_restart_reason"</span>;
};
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-27" class="outline-2">
<h2 id="sec-27">cpufreq driver</h2>
<div class="outline-text-2" id="text-27">
<p>
IPQ40xx SoC cpufreq driver for CPU frequency scaling.
</p>

<p>
<code>Documentation/devicetree/bindings/cpufreq/cpufreq-qca.txt</code>
</p>
<div class="org-src-container">

<pre class="src src-sh">cpu_freq_ipq40xx {
        <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"qca,ipq40xx_freq"</span>;
        clock-latency = &lt;100000&gt;;
        qcom,cpufreq-table =
        &lt; 48000 &gt;,
        &lt; 200000 &gt;,
        &lt; 500000 &gt;,
        &lt; 716000 &gt;;
};
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-28" class="outline-2">
<h2 id="sec-28">qcom-ipq40xx-ap.dk04.1</h2>
<div class="outline-text-2" id="text-28">
</div><div id="outline-container-sec-28-1" class="outline-3">
<h3 id="sec-28-1">uart1(serial)</h3>
<div class="outline-text-3" id="text-28-1">
<p>
<code>arch/arm/boot/dts/qcom-ipq40xx-hsuart.dtsi</code>
</p>

<p>
<code>msm-hsuart-v14</code>: <code>Documentation/devicetree/bindings/tty/serial/msm_serial_hs.txt</code>
</p>
<div class="org-src-container">

<pre class="src src-sh">uart1:uart@78b0000 {
                <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"qcom,msm-hsuart-v14"</span>;
                <span style="color: #eedd82;">reg</span> = &lt;0x78b0000 0x200&gt;,
                        &lt;0x7884000 0x23000&gt;;
                reg-names = <span style="color: #ffa07a;">"core_mem"</span>, <span style="color: #ffa07a;">"bam_mem"</span>;
                interrupt-names = <span style="color: #ffa07a;">"core_irq"</span>, <span style="color: #ffa07a;">"bam_irq"</span>;
                <span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">address-cells = &lt;0&gt;;</span>
                interrupt-parent = &lt;&amp;uart1&gt;;
                <span style="color: #eedd82;">interrupts</span> = &lt;0 1 2&gt;;
                <span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">interrupt-cells = &lt;1&gt;;</span>
                interrupt-map-mask = &lt;0xffffffff&gt;;
                interrupt-map = &lt;0 &amp;intc 0 108 0
                        1 &amp;intc 0 238 0&gt;;
                qcom,bam-tx-ep-pipe-index = &lt;2&gt;;
                qcom,bam-rx-ep-pipe-index = &lt;3&gt;;
                qcom,master-id = &lt;86&gt;;
                <span style="color: #eedd82;">clocks</span> = &lt;&amp;gcc GCC_BLSP1_AHB_CLK&gt;,
                        &lt;&amp;gcc GCC_BLSP1_UART2_APPS_CLK&gt;;
                clock-names = <span style="color: #ffa07a;">"iface_clk"</span>, <span style="color: #ffa07a;">"core_clk"</span>;
                <span style="color: #eedd82;">status</span> = <span style="color: #ffa07a;">"disabled"</span>;
                };
</pre>
</div>
</div>
</div>
