src/Embedded-System/Qcom-ipq40xx/ipq40xx-device-tree-overview.org
** qcom-ipq40xx-ap.dk04.1
#+begin_src sh

/ {
	model = "Qualcomm Technologies, Inc. IPQ40xx/AP-DK04.1";
	compatible = "qcom,ipq40xx-apdk04.1", "qcom,ipq40xx";

	memory {
		device_type = "memory";
		reg = <0x80000000 0x10000000>; /* 256MB */
	};

	reserved-memory {
		#address-cells = <1>;
		#size-cells = <1>;
		ranges;
		rsvd1@87000000 {
			/* Reserved for other subsystem */
			reg = <0x87000000 0x500000>;
			no-map;
		};
		wifi_dump@87500000 {
			reg = <0x87500000 0x600000>;
			no-map;
		};

		rsvd2@87B00000 {
			/* Reserved for other subsystem */
			reg = <0x87B00000 0x500000>;
			no-map;
		};
	};

	chosen {
		bootargs-append = " clk_ignore_unused";
	};

};
	&soc {
		pinctrl@0x01000000 {
			serial_0_pins: serial0_pinmux {
				mux {
					pins = "gpio16", "gpio17";
					function = "blsp_uart0";
					bias-disable;
				};
			};

			led_0_pins: led0_pinmux {
				mux_1 {
					pins = "gpio36";
					function = "led0";
					bias-pull-down;
				};
				mux_2 {
					pins = "gpio40";
					function = "led4";
					bias-pull-down;
				};
			};

			serial_1_pins: serial1_pinmux {
				mux {
					pins = "gpio8", "gpio9";
					function = "blsp_uart1";
					bias-disable;
				};
			};

			uart1_pins: uart1_pinmux {
				mux {
					pins = "gpio8", "gpio9", "gpio10", "gpio11";
					function = "blsp_uart1";
					bias-disable;
				};
			};

			spi_0_pins: spi_0_pinmux {
				mux {
					pins = "gpio12", "gpio13", "gpio14", "gpio15";
					function = "blsp_spi0";
					bias-disable;
				};
			};

			i2c_0_pins: i2c_0_pinmux {
				mux {
					pins = "gpio20", "gpio21";
					function = "blsp_i2c0";
					bias-disable;
				};
			};
			sd_0_pins: sd_0_pinmux {
				sd0 {
					pins = "gpio23";
					function = "sdio0";
					drive-strength = <10>;
				};
				sd1 {
					pins = "gpio24";
					function = "sdio1";
					drive-strength = <10>;
				};
				sd2 {
					pins = "gpio25";
					function = "sdio2";
					drive-strength = <10>;
				};
				sd3 {
					pins = "gpio26";
					function = "sdio3";
					drive-strength = <10>;
				};
				sdclk {
					pins = "gpio27";
					function = "sdio_clk";
					drive-strength = <16>;
				};
				sdcmd {
					pins = "gpio28";
					function = "sdio_cmd";
					drive-strength = <10>;
				};
				sd4 {
					pins = "gpio29";
					function = "sdio4";
					drive-strength = <10>;
				};
				sd5 {
					pins = "gpio30";
					function = "sdio5";
					drive-strength = <10>;
				};
				sd6 {
					pins = "gpio31";
					function = "sdio6";
					drive-strength = <10>;
				};
				sd7 {
					pins = "gpio32";
					function = "sdio7";
					drive-strength = <10>;
					bias-disable;
				};
			};
			ts_0_pins: ts_0_pinmux {
				mux_1 {
					pins = "gpio34";
					output-high;
				};
				mux_2 {
					pins= "gpio35";
					input-enable;
					bias-pull-up;
				};
			};
		};

		serial@78af000 {
			pinctrl-0 = <&serial_0_pins>;
			pinctrl-names = "default";
			status = "ok";
		};

		serial@78b0000 {
			pinctrl-0 = <&serial_1_pins>;
			pinctrl-names = "default";
			status = "ok";
		};

		uart1:uart@78b0000 {
			pinctrl-0 = <&uart1_pins>;
			pinctrl-1 = <&uart1_pins>;
			pinctrl-names = "default", "sleep";
			status = "disabled";
		};

		spi_0: spi@78b5000 { /* BLSP1 QUP1 */
			pinctrl-0 = <&spi_0_pins>;
			pinctrl-names = "default";
			status = "ok";

			m25p80@0 {
				#address-cells = <1>;
				#size-cells = <1>;
				reg = <0>;
				compatible = "n25q128a11";
				linux,modalias = "m25p80", "n25q128a11";
				spi-max-frequency = <24000000>;
				use-default-sizes;
			};
		};

		tcsr: tcsr@194b000 {
			status = "ok";
		};

		usb3_ss_phy: ssphy@0 {
			status = "ok";
		};

		dummy_ss_phy: ssphy@1 {
			status = "ok";
		};

		usb3_hs_phy: hsphy@a6000 {
			status = "ok";
		};

		usb2_hs_phy: hsphy@a8000 {
			status = "ok";
		};

		usb3: usb3@8a00000 {
			status = "ok";
		};

		usb2: usb2@6000000 {
			status = "ok";
		};

		i2c_0: i2c@78b7000 { /* BLSP1 QUP2 */
			pinctrl-0 = <&i2c_0_pins>;
			pinctrl-1 = <&i2c_0_pins>;
			pinctrl-names = "i2c_active", "i2c_sleep";
			status = "ok";

			qca_codec: qca_codec@12 {
				compatible = "qca,ipq40xx-codec";
				reg = <0x12>;
				status = "disabled";
			};

			lcd_ts: lcd_ts@40 {
				compatible = "qca,gsl1680_ts";
				reg = <0x40>;
				status = "disabled";
			};
		};

		qcom_crypto: qcrypto@8e20000 {
			status = "ok";
		};

		qcom_cedev: qcedev@8e20000 {
			status = "ok";
		};

		pcie0: qcom,pcie@80000 {
			status = "ok";
			perst-gpio = <&tlmm 57 0>;
			wake-gpio = <&tlmm 50 0>;
			clkreq-gpio = <&tlmm 39 0>;
		};

		qcom: ledc@1937000  {
			status = "ok";
			pinctrl-0 = <&led_0_pins>;
			pinctrl-names = "default";
		};

		ess-switch@c000000 {
			switch_mac_mode = <0x0>; /* mac mode for RGMII RMII */
			switch_initvlas = <
				0x0007c 0x54 /* PORT0_STATUS */
			>;
			led_source@0 {
				source = <0x1>;  /*source id 1 */
				mode = "normal"; /*on,off,blink,normal */
				speed = "all";   /*10M,100M,1000M,all */
				freq = "auto";   /*2Hz,4Hz,8Hz,auto*/
			};
			led_source@1 {
				source = <0x4>;  /*source id 4 */
				mode = "normal"; /*on,off,blink,normal */
				speed = "all";   /*10M,100M,1000M,all */
				freq = "auto";   /*2Hz,4Hz,8Hz,auto*/
			};
			led_source@2 {
				source = <0x7>;  /*source id 7 */
				mode = "normal"; /*on,off,blink,normal */
				speed = "all";   /*10M,100M,1000M,all */
				freq = "auto";   /*2Hz,4Hz,8Hz,auto*/
			};
			led_source@3 {
				source = <0xa>;  /*source id 10 */
				mode = "normal"; /*on,off,blink,normal */
				speed = "all";   /*10M,100M,1000M,all */
				freq = "auto";   /*2Hz,4Hz,8Hz,auto*/
			};
			led_source@4 {
				source = <0xd>;  /*source id 13 */
				mode = "normal"; /*on,off,blink,normal */
				speed = "all";   /*10M,100M,1000M,all */
				freq = "auto";   /*2Hz,4Hz,8Hz,auto*/
			};
		};

		vccq_sd0: regulator@0 {
			compatible = "qcom,regulator-ipq40xx";
			regulator-name = "SD0 VccQ";
			regulator-min-microvolt = <1800000>;
			regulator-max-microvolt = <3000000>;
			states = <3000000 0x3
				1800000 0x1>;
			reg = <0x01948000 0x4>;
			mask = <0x3>;
		};

		sdhci@7824000 {
			status = "ok";
			pinctrl-0 = <&sd_0_pins>;
			pinctrl-names = "default";
			vqmmc-supply = <&vccq_sd0>;
			cd-gpios = <&tlmm 22 0x1>;
			sd-ldo-gpios = <&tlmm 33 0x1>;
		};

		qcom,nand@7980000 {
			status = "disabled";
		};

		gpio_keys {
			compatible = "gpio-keys";

			button@1 {
				label = "wps";
				linux,code = <KEY_WPS_BUTTON>;
				gpios = <&tlmm 18 GPIO_ACTIVE_LOW>;
				linux,input-type = <1>;
			};
		};

	};
#+end_src


