public_html/Embedded-System/Qcom-ipq40xx/ipq40xx-device-tree-overview.html

<div id="outline-container-sec-28-2" class="outline-3">
<h3 id="sec-28-2">qcom-ipq40xx-ap.dk04.1</h3>
<div class="outline-text-3" id="text-28-2">
<div class="org-src-container">

<pre class="src src-sh">/ {
        <span style="color: #eedd82;">model</span> = <span style="color: #ffa07a;">"Qualcomm Technologies, Inc. IPQ40xx/AP-DK04.1"</span>;
        <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"qcom,ipq40xx-apdk04.1"</span>, <span style="color: #ffa07a;">"qcom,ipq40xx"</span>;

        memory {
                <span style="color: #eedd82;">device_type</span> = <span style="color: #ffa07a;">"memory"</span>;
                <span style="color: #eedd82;">reg</span> = &lt;0x80000000 0x10000000&gt;; /* 256MB */
        };

        reserved-memory {
                <span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">address-cells = &lt;1&gt;;</span>
                <span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">size-cells = &lt;1&gt;;</span>
                ranges;
                rsvd1@87000000 {
                        /* Reserved for other subsystem */
                        <span style="color: #eedd82;">reg</span> = &lt;0x87000000 0x500000&gt;;
                        no-map;
                };
                wifi_dump@87500000 {
                        <span style="color: #eedd82;">reg</span> = &lt;0x87500000 0x600000&gt;;
                        no-map;
                };

                rsvd2@87B00000 {
                        /* Reserved for other subsystem */
                        <span style="color: #eedd82;">reg</span> = &lt;0x87B00000 0x500000&gt;;
                        no-map;
                };
        };

        chosen {
                bootargs-append = <span style="color: #ffa07a;">" clk_ignore_unused"</span>;
        };

};
        &amp;soc {
                pinctrl@0x01000000 {
                        serial_0_pins: serial0_pinmux {
                                mux {
                                        <span style="color: #eedd82;">pins</span> = <span style="color: #ffa07a;">"gpio16"</span>, <span style="color: #ffa07a;">"gpio17"</span>;
                                        <span style="color: #eedd82;">function</span> = <span style="color: #ffa07a;">"blsp_uart0"</span>;
                                        bias-disable;
                                };
                        };

                        led_0_pins: led0_pinmux {
                                mux_1 {
                                        <span style="color: #eedd82;">pins</span> = <span style="color: #ffa07a;">"gpio36"</span>;
                                        <span style="color: #eedd82;">function</span> = <span style="color: #ffa07a;">"led0"</span>;
                                        bias-pull-down;
                                };
                                mux_2 {
                                        <span style="color: #eedd82;">pins</span> = <span style="color: #ffa07a;">"gpio40"</span>;
                                        <span style="color: #eedd82;">function</span> = <span style="color: #ffa07a;">"led4"</span>;
                                        bias-pull-down;
                                };
                        };

                        serial_1_pins: serial1_pinmux {
                                mux {
                                        <span style="color: #eedd82;">pins</span> = <span style="color: #ffa07a;">"gpio8"</span>, <span style="color: #ffa07a;">"gpio9"</span>;
                                        <span style="color: #eedd82;">function</span> = <span style="color: #ffa07a;">"blsp_uart1"</span>;
                                        bias-disable;
                                };
                        };

                        uart1_pins: uart1_pinmux {
                                mux {
                                        <span style="color: #eedd82;">pins</span> = <span style="color: #ffa07a;">"gpio8"</span>, <span style="color: #ffa07a;">"gpio9"</span>, <span style="color: #ffa07a;">"gpio10"</span>, <span style="color: #ffa07a;">"gpio11"</span>;
                                        <span style="color: #eedd82;">function</span> = <span style="color: #ffa07a;">"blsp_uart1"</span>;
                                        bias-disable;
                                };
                        };

                        spi_0_pins: spi_0_pinmux {
                                mux {
                                        <span style="color: #eedd82;">pins</span> = <span style="color: #ffa07a;">"gpio12"</span>, <span style="color: #ffa07a;">"gpio13"</span>, <span style="color: #ffa07a;">"gpio14"</span>, <span style="color: #ffa07a;">"gpio15"</span>;
                                        <span style="color: #eedd82;">function</span> = <span style="color: #ffa07a;">"blsp_spi0"</span>;
                                        bias-disable;
                                };
                        };

                        i2c_0_pins: i2c_0_pinmux {
                                mux {
                                        <span style="color: #eedd82;">pins</span> = <span style="color: #ffa07a;">"gpio20"</span>, <span style="color: #ffa07a;">"gpio21"</span>;
                                        <span style="color: #eedd82;">function</span> = <span style="color: #ffa07a;">"blsp_i2c0"</span>;
                                        bias-disable;
                                };
                        };
                        sd_0_pins: sd_0_pinmux {
                                sd0 {
                                        <span style="color: #eedd82;">pins</span> = <span style="color: #ffa07a;">"gpio23"</span>;
                                        <span style="color: #eedd82;">function</span> = <span style="color: #ffa07a;">"sdio0"</span>;
                                        drive-strength = &lt;10&gt;;
                                };
                                sd1 {
                                        <span style="color: #eedd82;">pins</span> = <span style="color: #ffa07a;">"gpio24"</span>;
                                        <span style="color: #eedd82;">function</span> = <span style="color: #ffa07a;">"sdio1"</span>;
                                        drive-strength = &lt;10&gt;;
                                };
                                sd2 {
                                        <span style="color: #eedd82;">pins</span> = <span style="color: #ffa07a;">"gpio25"</span>;
                                        <span style="color: #eedd82;">function</span> = <span style="color: #ffa07a;">"sdio2"</span>;
                                        drive-strength = &lt;10&gt;;
                                };
                                sd3 {
                                        <span style="color: #eedd82;">pins</span> = <span style="color: #ffa07a;">"gpio26"</span>;
                                        <span style="color: #eedd82;">function</span> = <span style="color: #ffa07a;">"sdio3"</span>;
                                        drive-strength = &lt;10&gt;;
                                };
                                sdclk {
                                        <span style="color: #eedd82;">pins</span> = <span style="color: #ffa07a;">"gpio27"</span>;
                                        <span style="color: #eedd82;">function</span> = <span style="color: #ffa07a;">"sdio_clk"</span>;
                                        drive-strength = &lt;16&gt;;
                                };
                                sdcmd {
                                        <span style="color: #eedd82;">pins</span> = <span style="color: #ffa07a;">"gpio28"</span>;
                                        <span style="color: #eedd82;">function</span> = <span style="color: #ffa07a;">"sdio_cmd"</span>;
                                        drive-strength = &lt;10&gt;;
                                };
                                sd4 {
                                        <span style="color: #eedd82;">pins</span> = <span style="color: #ffa07a;">"gpio29"</span>;
                                        <span style="color: #eedd82;">function</span> = <span style="color: #ffa07a;">"sdio4"</span>;
                                        drive-strength = &lt;10&gt;;
                                };
                                sd5 {
                                        <span style="color: #eedd82;">pins</span> = <span style="color: #ffa07a;">"gpio30"</span>;
                                        <span style="color: #eedd82;">function</span> = <span style="color: #ffa07a;">"sdio5"</span>;
                                        drive-strength = &lt;10&gt;;
                                };
                                sd6 {
                                        <span style="color: #eedd82;">pins</span> = <span style="color: #ffa07a;">"gpio31"</span>;
                                        <span style="color: #eedd82;">function</span> = <span style="color: #ffa07a;">"sdio6"</span>;
                                        drive-strength = &lt;10&gt;;
                                };
                                sd7 {
                                        <span style="color: #eedd82;">pins</span> = <span style="color: #ffa07a;">"gpio32"</span>;
                                        <span style="color: #eedd82;">function</span> = <span style="color: #ffa07a;">"sdio7"</span>;
                                        drive-strength = &lt;10&gt;;
                                        bias-disable;
                                };
                        };
                        ts_0_pins: ts_0_pinmux {
                                mux_1 {
                                        <span style="color: #eedd82;">pins</span> = <span style="color: #ffa07a;">"gpio34"</span>;
                                        output-high;
                                };
                                mux_2 {
                                        <span style="color: #eedd82;">pins</span>= <span style="color: #ffa07a;">"gpio35"</span>;
                                        input-enable;
                                        bias-pull-up;
                                };
                        };
                };

                serial@78af000 {
                        pinctrl-0 = &lt;&amp;serial_0_pins&gt;;
                        pinctrl-names = <span style="color: #ffa07a;">"default"</span>;
                        <span style="color: #eedd82;">status</span> = <span style="color: #ffa07a;">"ok"</span>;
                };

                serial@78b0000 {
                        pinctrl-0 = &lt;&amp;serial_1_pins&gt;;
                        pinctrl-names = <span style="color: #ffa07a;">"default"</span>;
                        <span style="color: #eedd82;">status</span> = <span style="color: #ffa07a;">"ok"</span>;
                };

                uart1:uart@78b0000 {
                        pinctrl-0 = &lt;&amp;uart1_pins&gt;;
                        pinctrl-1 = &lt;&amp;uart1_pins&gt;;
                        pinctrl-names = <span style="color: #ffa07a;">"default"</span>, <span style="color: #ffa07a;">"sleep"</span>;
                        <span style="color: #eedd82;">status</span> = <span style="color: #ffa07a;">"disabled"</span>;
                };

                spi_0: spi@78b5000 { /* BLSP1 QUP1 */
                        pinctrl-0 = &lt;&amp;spi_0_pins&gt;;
                        pinctrl-names = <span style="color: #ffa07a;">"default"</span>;
                        <span style="color: #eedd82;">status</span> = <span style="color: #ffa07a;">"ok"</span>;

                        m25p80@0 {
                                <span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">address-cells = &lt;1&gt;;</span>
                                <span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">size-cells = &lt;1&gt;;</span>
                                <span style="color: #eedd82;">reg</span> = &lt;0&gt;;
                                <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"n25q128a11"</span>;
                                linux,<span style="color: #eedd82;">modalias</span> = <span style="color: #ffa07a;">"m25p80"</span>, <span style="color: #ffa07a;">"n25q128a11"</span>;
                                spi-max-frequency = &lt;24000000&gt;;
                                use-default-sizes;
                        };
                };

                tcsr: tcsr@194b000 {
                        <span style="color: #eedd82;">status</span> = <span style="color: #ffa07a;">"ok"</span>;
                };

                usb3_ss_phy: ssphy@0 {
                        <span style="color: #eedd82;">status</span> = <span style="color: #ffa07a;">"ok"</span>;
                };

                dummy_ss_phy: ssphy@1 {
                        <span style="color: #eedd82;">status</span> = <span style="color: #ffa07a;">"ok"</span>;
                };

                usb3_hs_phy: hsphy@a6000 {
                        <span style="color: #eedd82;">status</span> = <span style="color: #ffa07a;">"ok"</span>;
                };

                usb2_hs_phy: hsphy@a8000 {
                        <span style="color: #eedd82;">status</span> = <span style="color: #ffa07a;">"ok"</span>;
                };

                usb3: usb3@8a00000 {
                        <span style="color: #eedd82;">status</span> = <span style="color: #ffa07a;">"ok"</span>;
                };

                usb2: usb2@6000000 {
                        <span style="color: #eedd82;">status</span> = <span style="color: #ffa07a;">"ok"</span>;
                };

                i2c_0: i2c@78b7000 { /* BLSP1 QUP2 */
                        pinctrl-0 = &lt;&amp;i2c_0_pins&gt;;
                        pinctrl-1 = &lt;&amp;i2c_0_pins&gt;;
                        pinctrl-names = <span style="color: #ffa07a;">"i2c_active"</span>, <span style="color: #ffa07a;">"i2c_sleep"</span>;
                        <span style="color: #eedd82;">status</span> = <span style="color: #ffa07a;">"ok"</span>;

                        qca_codec: qca_codec@12 {
                                <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"qca,ipq40xx-codec"</span>;
                                <span style="color: #eedd82;">reg</span> = &lt;0x12&gt;;
                                <span style="color: #eedd82;">status</span> = <span style="color: #ffa07a;">"disabled"</span>;
                        };

                        lcd_ts: lcd_ts@40 {
                                <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"qca,gsl1680_ts"</span>;
                                <span style="color: #eedd82;">reg</span> = &lt;0x40&gt;;
                                <span style="color: #eedd82;">status</span> = <span style="color: #ffa07a;">"disabled"</span>;
                        };
                };

                qcom_crypto: qcrypto@8e20000 {
                        <span style="color: #eedd82;">status</span> = <span style="color: #ffa07a;">"ok"</span>;
                };

                qcom_cedev: qcedev@8e20000 {
                        <span style="color: #eedd82;">status</span> = <span style="color: #ffa07a;">"ok"</span>;
                };

                pcie0: qcom,pcie@80000 {
                        <span style="color: #eedd82;">status</span> = <span style="color: #ffa07a;">"ok"</span>;
                        perst-gpio = &lt;&amp;tlmm 57 0&gt;;
                        wake-gpio = &lt;&amp;tlmm 50 0&gt;;
                        clkreq-gpio = &lt;&amp;tlmm 39 0&gt;;
                };

                qcom: ledc@1937000  {
                        <span style="color: #eedd82;">status</span> = <span style="color: #ffa07a;">"ok"</span>;
                        pinctrl-0 = &lt;&amp;led_0_pins&gt;;
                        pinctrl-names = <span style="color: #ffa07a;">"default"</span>;
                };

                ess-switch@c000000 {
                        <span style="color: #eedd82;">switch_mac_mode</span> = &lt;0x0&gt;; /* mac mode for RGMII RMII */
                        <span style="color: #eedd82;">switch_initvlas</span> = &lt;
                                0x0007c 0x54 /* PORT0_STATUS */
                        &gt;;
                        led_source@0 {
                                <span style="color: #eedd82;">source</span> = &lt;0x1&gt;;  /*source id 1 */
                                <span style="color: #eedd82;">mode</span> = <span style="color: #ffa07a;">"normal"</span>; /*on,off,blink,normal */
                                <span style="color: #eedd82;">speed</span> = <span style="color: #ffa07a;">"all"</span>;   /*10M,100M,1000M,all */
                                <span style="color: #eedd82;">freq</span> = <span style="color: #ffa07a;">"auto"</span>;   /*2Hz,4Hz,8Hz,auto*/
                        };
                        led_source@1 {
                                <span style="color: #eedd82;">source</span> = &lt;0x4&gt;;  /*source id 4 */
                                <span style="color: #eedd82;">mode</span> = <span style="color: #ffa07a;">"normal"</span>; /*on,off,blink,normal */
                                <span style="color: #eedd82;">speed</span> = <span style="color: #ffa07a;">"all"</span>;   /*10M,100M,1000M,all */
                                <span style="color: #eedd82;">freq</span> = <span style="color: #ffa07a;">"auto"</span>;   /*2Hz,4Hz,8Hz,auto*/
                        };
                        led_source@2 {
                                <span style="color: #eedd82;">source</span> = &lt;0x7&gt;;  /*source id 7 */
                                <span style="color: #eedd82;">mode</span> = <span style="color: #ffa07a;">"normal"</span>; /*on,off,blink,normal */
                                <span style="color: #eedd82;">speed</span> = <span style="color: #ffa07a;">"all"</span>;   /*10M,100M,1000M,all */
                                <span style="color: #eedd82;">freq</span> = <span style="color: #ffa07a;">"auto"</span>;   /*2Hz,4Hz,8Hz,auto*/
                        };
                        led_source@3 {
                                <span style="color: #eedd82;">source</span> = &lt;0xa&gt;;  /*source id 10 */
                                <span style="color: #eedd82;">mode</span> = <span style="color: #ffa07a;">"normal"</span>; /*on,off,blink,normal */
                                <span style="color: #eedd82;">speed</span> = <span style="color: #ffa07a;">"all"</span>;   /*10M,100M,1000M,all */
                                <span style="color: #eedd82;">freq</span> = <span style="color: #ffa07a;">"auto"</span>;   /*2Hz,4Hz,8Hz,auto*/
                        };
                        led_source@4 {
                                <span style="color: #eedd82;">source</span> = &lt;0xd&gt;;  /*source id 13 */
                                <span style="color: #eedd82;">mode</span> = <span style="color: #ffa07a;">"normal"</span>; /*on,off,blink,normal */
                                <span style="color: #eedd82;">speed</span> = <span style="color: #ffa07a;">"all"</span>;   /*10M,100M,1000M,all */
                                <span style="color: #eedd82;">freq</span> = <span style="color: #ffa07a;">"auto"</span>;   /*2Hz,4Hz,8Hz,auto*/
                        };
                };

                vccq_sd0: regulator@0 {
                        <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"qcom,regulator-ipq40xx"</span>;
                        regulator-name = <span style="color: #ffa07a;">"SD0 VccQ"</span>;
                        regulator-min-microvolt = &lt;1800000&gt;;
                        regulator-max-microvolt = &lt;3000000&gt;;
                        <span style="color: #eedd82;">states</span> = &lt;3000000 0x3
                                1800000 0x1&gt;;
                        <span style="color: #eedd82;">reg</span> = &lt;0x01948000 0x4&gt;;
                        <span style="color: #eedd82;">mask</span> = &lt;0x3&gt;;
                };

                sdhci@7824000 {
                        <span style="color: #eedd82;">status</span> = <span style="color: #ffa07a;">"ok"</span>;
                        pinctrl-0 = &lt;&amp;sd_0_pins&gt;;
                        pinctrl-names = <span style="color: #ffa07a;">"default"</span>;
                        vqmmc-supply = &lt;&amp;vccq_sd0&gt;;
                        cd-gpios = &lt;&amp;tlmm 22 0x1&gt;;
                        sd-ldo-gpios = &lt;&amp;tlmm 33 0x1&gt;;
                };

                qcom,nand@7980000 {
                        <span style="color: #eedd82;">status</span> = <span style="color: #ffa07a;">"disabled"</span>;
                };

                gpio_keys {
                        <span style="color: #eedd82;">compatible</span> = <span style="color: #ffa07a;">"gpio-keys"</span>;

                        button@1 {
                                <span style="color: #eedd82;">label</span> = <span style="color: #ffa07a;">"wps"</span>;
                                linux,<span style="color: #eedd82;">code</span> = &lt;KEY_WPS_BUTTON&gt;;
                                <span style="color: #eedd82;">gpios</span> = &lt;&amp;tlmm 18 GPIO_ACTIVE_LOW&gt;;
                                linux,input-type = &lt;1&gt;;
                        };
                };

        };
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shi Shougang</p>
<p class="date">Created: 2016-12-14 Wed 22:19</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
